{
    "1": {
        "product_name": "Hello Bello Diapers, Size 1 (8-12 lbs) Wild Cats, 128 Count Value Pack of Premium Disposable Baby Diapers, Hypoallergenic with Soft, Cloth-Like Feel",
        "url": "https://www.amazon.com/Hello-Bello-Disposable-Hypoallergenic-Cloth-Like/dp/B0DN7ZQFXN/ref=sr_1_1_sspa",
        "reviews": {
            "1": {
                "name": "Ang",
                "date": "Reviewed in the United States on February 12, 2025",
                "stars": "5.0",
                "title": "Great quality - switched from Honest",
                "product_specs": "Color: Wild CatsSize: Size 2",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "I was hesitant to switch from Honest to Hello Bello but I honestly am so impressed with the quality! These are just as absorbent as the Honest brand and have the same quality, no toxic chemicals, no fragrance. It is perfect. They have cute designs just like Honest does too and for a much better price! I’m happy I tried these for my baby.\n\nI see people in the reviews complain about them not being as absorbent as they would like but personally, I would never keep my baby in even a wet diaper knowing he’s uncomfortable. I have an 11 week old baby that sleeps through the night and he doesn’t wake up in discomfort not once for diaper change but he also rarely soils the diaper at night.\n\nHope this helps other parents!"
            },
            "2": {
                "name": "Chelsie Anguiano",
                "date": "Reviewed in the United States on January 27, 2025",
                "stars": "5.0",
                "title": "great diapers",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I’m incredibly impressed with **Hello Bello Diapers in Size 3 (Wild Cats design)**! They offer a perfect combination of style, comfort, and performance. The adorable wild cats print is such a fun touch that makes diaper changes more cheerful.\n\n**Absorbency:** These diapers are highly absorbent and can last through long naps and even overnight without leaks. They do an excellent job of keeping my little one dry and comfortable.\n\n**Fit:** The size 3 diapers fit my baby (17 lbs) perfectly, with a snug yet gentle fit around the waist and legs. The stretchy tabs make it easy to get a secure fit, which prevents leaks while allowing my baby to move freely.\n\n**Softness:** The material is super soft, which is important for sensitive baby skin. We haven’t had any issues with diaper rashes or irritation since switching to Hello Bello.\n\n**Eco-Conscious:** I also love that Hello Bello prioritizes being eco-friendly while maintaining affordability. It’s nice knowing these diapers are made with plant-based ingredients without sacrificing quality.\n\n**Value:** The 100-count value pack is such a great deal. It’s convenient not having to buy diapers as often, and I appreciate the quality at this price point.\n\nOverall, I highly recommend **Hello Bello Diapers** for any parent looking for a high-quality, stylish, and reliable diaper option. It’s a win-win for both baby and parent!"
            },
            "3": {
                "name": "D. Luu",
                "date": "Reviewed in the United States on February 24, 2025",
                "stars": "4.0",
                "title": "good quality but wetness detector not so intuitive",
                "product_specs": "Color: Wild CatsSize: Size 1",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Decent quality diapers, easy to strap on the velcro to secure diaper. Contains pee and poo easily but blowouts can still occur. The wetness indicator is not as intuitive though being a shade of green or yellow when changing and starts out at yellow. Other brand diapers just have it change to blue for wet, not these it seems."
            },
            "4": {
                "name": "Bob Dugas",
                "date": "Reviewed in the United States on February 16, 2025",
                "stars": "5.0",
                "title": "Simply Diapers",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "These are used when our grand daughter comes over. They are sized appropriately and fit fine. As far as absorbency and holding everything in, they do an average job. Not quite as good as the more expensive brands like pampers, but they do a good job for their price. We don't get excited about any design on them, since they are just disposable diapers and are often under clothing, but the design is cute.\n\nThe closure holds tight and have not let go even once. No issue with chaffing or binding around the legs. We like them and will consider them when we have to buy more."
            },
            "5": {
                "name": "Jared N.",
                "date": "Reviewed in the United States on February 19, 2025",
                "stars": "5.0",
                "title": "Luxury diaper with the cutest patterns",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "We have always thought about switching to HelloBello but have stayed with our usual diaper brand. Now that we have our third and final kid, we thought we would try something new and wow - these did not disappoint. These diapers were soft and felt like a luxurious splurge, even though they were very affordable. The leak protection and absorbency is comparable to other brands. These diapers seem to run slightly smaller than other brands, but that isn’t a deal breaker. Having the fun patterns on them seals the deal."
            },
            "6": {
                "name": "CAM",
                "date": "Reviewed in the United States on February 12, 2025",
                "stars": "5.0",
                "title": "Wish I’d have tried these sooner",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "This was my first time using hello Bello diapers for my now almost 3-year-old. I think that these have become my favorite diapers. Not only do they seem to have a great amount of absorbing space, but I noticed that the front is not wet when he pees a bunch like other brands where sometimes the pee will continue to soak through the front or sides of the diaper. There is no smell, and there is no pee smell after they’ve been used. They did not cause any form of chafing on my active boy. I truly think that these are great diapers and will continue to get them!!"
            },
            "7": {
                "name": "Dolly",
                "date": "Reviewed in the United States on February 13, 2025",
                "stars": "4.0",
                "title": "Good Diaper",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "These Hello Bello Diapers are so cute with the cat print design. I found the diaper to do a good job at being snug at the right areas and the side tabs fit securely. I like that these diapers are hypoallergenic and are made with better plant-based ingredients. They work well for day use but I don't find them as absorbent for overnight use."
            },
            "8": {
                "name": "ESIII",
                "date": "Reviewed in the United States on February 21, 2025",
                "stars": "5.0",
                "title": "Nice diaper",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I ordered these for my nephew. They work great. They fit him nicely and from what I can tell they work just as well as other name brand diapers. He hasn't had any leaks and he's pretty active.\n\nNot much more to say about a diaper. It gets the job done."
            },
            "9": {
                "name": "Victoriahannah",
                "date": "Reviewed in the United States on November 23, 2024",
                "stars": "3.0",
                "title": "They are ok",
                "product_specs": "Color: SunnysideSize: Size 4",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "I don’t love them. Only the back stretches which ends up leaving a gap on my babies behind."
            },
            "10": {
                "name": "Miranda Perry",
                "date": "Reviewed in the United States on January 15, 2025",
                "stars": "1.0",
                "title": "Cute but cheap",
                "product_specs": "Color: Flower ChildSize: Size 3",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "I have 4 children in diapers, and you’re better off with Huggies or Pampers. These leak so incredibly bad."
            },
            "11": {
                "name": "CL",
                "date": "Reviewed in the United States on January 29, 2025",
                "stars": "4.0",
                "title": "These diapers are amazing!",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "They’re super soft and gentle on my baby’s sensitive skin. The flower child design is adorable, and they’re surprisingly absorbent, even overnight. I love that they’re hypoallergenic and have a cloth-like feel. A great choice for parents looking for premium quality at a reasonable price."
            },
            "12": {
                "name": "MC",
                "date": "Reviewed in the United States on January 22, 2025",
                "stars": "4.0",
                "title": "Not a daily go to",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "While these diapers are very cute and are a nice alternative to the mass produced versions, they simply don’t seem to be as absorbent as the name brands."
            },
            "13": {
                "name": "JB",
                "date": "Reviewed in the United States on January 21, 2025",
                "stars": "4.0",
                "title": "Cute diapers",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These Hello Bello diapers are s super cute. They are soft and seem comfortable for the baby. I like that they are hypoallergenic and don't seem to cause any skin irritation. So far these have been holding up very well, no leaks at all. When comparing with other popular brands, these stand out as the superior for us. The price point is a bit higher than some others, but the overall Hello Bello brand has become our favorite for all baby and children's products."
            },
            "14": {
                "name": "Lamatzue102002",
                "date": "Reviewed in the United States on January 7, 2025",
                "stars": "4.0",
                "title": "Functional and more",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "It is pleasing to open this box of diapers and be greeted with a colorful display as opposed to plain white. As least you are diverted from the task at hand for a little while. The diapers are soft and I love that they are hypoallergenic. They hold the baby output very well. They did not leak and the elastic near the baby will not irritate. There is a double gasket for protection around the legs. I like the way the tabs work, easy to open and close for readjustment."
            },
            "15": {
                "name": "MBK",
                "date": "Reviewed in the United States on January 15, 2025",
                "stars": "4.0",
                "title": "Cute prints!",
                "product_specs": "Color: Flower ChildSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are cute prints! The flower child one is a bit feminine, but I still put my son in them. My kid is on the smaller size of the weight for a size 4. I found that when he had poops he sometimes leaked the tiniest bit around the leg holes. There is no blowout guard at the top of the back for those wondering. Generally absorbent, but not so much so that I can use it as an overnight diaper."
            },
            "16": {
                "name": "MS",
                "date": "Reviewed in the United States on January 14, 2025",
                "stars": "4.0",
                "title": "Well made",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers in size 6 are a solid choice for parents seeking a balance between comfort and reliability. This is my first time trying this brand. The hypoallergenic material is gentle on sensitive skin, and the soft, cloth-like feel adds a touch of luxury. They fit well and handle most messes effectively, though occasional leaks can happen overnight. They stick well too! The adorable “Flower Child” design is a fun bonus, making diaper changes a little more cheerful. While slightly pricier than some alternatives, the quality, medium thickness, and thoughtful design make these diapers worth considering. They’re not super bulky, which is great."
            },
            "17": {
                "name": "Tonilynn Rosario",
                "date": "Reviewed in the United States on January 11, 2025",
                "stars": "4.0",
                "title": "Premium Hello Bello diapers",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "This box comes with 68 diapers that are packaged 17 per bag. The bag they come in is see through and the diapers design is geared for girls. These have a blue line that is noticeable once the diapers are wet with urine. The diapers are soft and has a great leg fit. These were a bit small for niece who wears a 6 ( my opinion these could be a size 5 fit) the velcro is snug and hold up really well , but once wet I feel that there is no dry wicking to get urine off of child and would need to be changed right after.\nI do like how soft these are against my granddaughters , but as far as saving me money they just fall short. The price point is average for each package of 17 diapers nothing that would make me change current diapers."
            },
            "18": {
                "name": "SoCalGirl",
                "date": "Reviewed in the United States on January 1, 2025",
                "stars": "4.0",
                "title": "Super Soft, Not the Most Absorbent",
                "product_specs": "Color: Wild CatsSize: Size 1",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "The Hello Bello Wild Cats diapers feature an adorable design and are incredibly soft and comfortable, with plenty of stretch in the leg elastics. The tabs stay secure in place, and they fit my 10-pound niece perfectly. Plus, they're free from harmful chemicals, and the company's values aligns well with our family's.\n\nHowever, compared to my sister's usual brand, these diapers are slightly thinner and less absorbent. While they've remained accident-free after a week of use, my sister is hesitant to switch brands and wants to see how well these diapers perform as her baby approaches the 12-pound upper weight limit."
            },
            "19": {
                "name": "KristyMc",
                "date": "Reviewed in the United States on January 3, 2025",
                "stars": "4.0",
                "title": "Good alternative to bigger brands",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "I'm always looking to support better, mindful products that don't use a ton of unnecessary chemicals in their items, and these looked to be a good alternative. They are indeed very soft, but not as thick nor absorbent as the big name established brands. However, for a child is who is starting to transition away from diapers, these are a very good option."
            },
            "20": {
                "name": "Amb",
                "date": "Reviewed in the United States on December 30, 2024",
                "stars": "4.0",
                "title": "Super soft, but not as absorbent as I'd like",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "They’re a little taller than the brand name ones we usually get, but not by much, so it works out for my daughter when she’s between sizes. The diapers are softer than the others we use, though a bit thinner. She’s potty training so we haven’t had a lot of soaked diapers. Out of the ones we did have, only two leaked a bit. I'm not sure if it matters, but both times she was sleeping on her belly and some of the wetness was felt through the front of her diaper, not around her legs. I think it’s from how thin the diapers are. Overall they’re fine for her during the day since they’re not getting too wet with the frequent potty visits, but overnight there may be some small leaks."
            },
            "21": {
                "name": "Amazon Customer",
                "date": "Reviewed in the United States on December 29, 2024",
                "stars": "4.0",
                "title": "No blow out barrier in the back",
                "product_specs": "Color: Wild CatsSize: Size 1",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Overall, I love these diapers! The price of $0.28/diaper is comparable to what I pay for Huggies and Pampers, but these have better ingredients and super cute designs. I’ve tried at least 5 different kinds of diapers lately because we keep having issues with blow outs. These diapers are soft and stretchy. The tabs stretch and pull tightly for a nice fit. I don’t have much of an issue with leaks on the sides, and never any issues with urine only, but I’m still getting blow outs up the back. At this point, I think it might be time to size up, but there also isn’t a barrier pocket in the back to keep everything in the diaper. My son is 11 pounds so I got a size 1."
            },
            "22": {
                "name": "Consumer",
                "date": "Reviewed in the United States on December 30, 2024",
                "stars": "4.0",
                "title": "Great fit for big kids",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are really fun diapers that make my 4 year old feel less awkward about still needing to wear diapers to sleep. She is big for her age (about 43 inches, 43 pounds) so we are starting to have a hard time finding something that fits well and is absorbent enough to last all night, but these really fit the bill. They are very soft inside - actually softer than the cloth diapers we used when our kids were babies, almost like a tissue, but have been absorbent so far. It's not a big deal in our case but I was surprised that they don't have a wetness indicator, which might be a game changer for an infant or younger kid."
            },
            "23": {
                "name": "DEEDEE",
                "date": "Reviewed in the United States on January 5, 2025",
                "stars": "4.0",
                "title": "Awesome",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "So far the qualities these diapers are good my baby hasn’t had any rash issues as of right now they work perfectly fine. They hold the pee. they hold #2 they’re perfect."
            },
            "24": {
                "name": "Steven Chang",
                "date": "Reviewed in the United States on December 29, 2024",
                "stars": "4.0",
                "title": "Soft, Hypoallergenic Baby Diapers with Adorable Prints",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These disposable baby diapers are of excellent quality, featuring an adorable wild cats print. I love that they are hypoallergenic, making them gentle on sensitive skin, and they feel incredibly soft to the touch.\n\nThe diapers also absorb quickly, and so far, we haven’t experienced any leakage issues. A reliable and stylish choice for parents looking for comfort and protection for their little ones."
            },
            "25": {
                "name": "Ki",
                "date": "Reviewed in the United States on December 20, 2024",
                "stars": "4.0",
                "title": "Soft cloth feel, cute print, basic diaper",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "These diapers have a unique soft cloth like feel and mine had a really cute flower print on them. Although you don't really see the print with pants on, it is a cute touch. I didn't have any issues with leakage or skin irritation so far, they have a standard cuff inside to help with that. The only drawback is the price is higher than compared to other big box brands. However, if you eco-friendly purchases are important to you, these are a good option helping the cause. I know a few of my friends would like these as an option too."
            },
            "26": {
                "name": "Cam",
                "date": "Reviewed in the United States on January 1, 2025",
                "stars": "4.0",
                "title": "Good price",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are great diapers for the price. They don’t leak but I feel like they don’t hold as much as other brands. They are soft and have cute designs."
            },
            "27": {
                "name": "Scott",
                "date": "Reviewed in the United States on December 28, 2024",
                "stars": "4.0",
                "title": "Diapers",
                "product_specs": "Color: Wild CatsSize: Size 1",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "Diapers are not cheap and these seem decent enough with a cute pattern although most people don’t care about the pattern but the leakage protection. I wouldn’t say they are up there with the premium diapers but they are ok and do what they are supposed to do."
            },
            "28": {
                "name": "Christine James",
                "date": "Reviewed in the United States on January 6, 2025",
                "stars": "4.0",
                "title": "Ok diapers overall",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "We love trying new diapers to compare to the usual brand we use. These diapers fit pretty well overall and have pretty secure attatchment tabs. The diapers were ok during the day but we had to monitor them over night after having a few leaks."
            },
            "29": {
                "name": "J. Lam",
                "date": "Reviewed in the United States on December 24, 2024",
                "stars": "4.0",
                "title": "surprised witht he color",
                "product_specs": "Color: Flower ChildSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "So typical diapers are primarily white and possible with colored decor. These are not. Don't get me wrong, they are cute and give a new breath to boring white diapers. They are super absorbent, and they are easily put on. The designs are cute and these are quite easy to dispose of in a tight smelly ball."
            },
            "30": {
                "name": "✨Mr. King",
                "date": "Reviewed in the United States on December 30, 2024",
                "stars": "4.0",
                "title": "Love it",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Got this for my 3 months old baby girl.\nCute and soft.\nShe has really sensitive skin, and this diaper won't harm her skin.\nIt doesn't leak.\nNot that stretchable.\nIt is also kind of thin.\nIt is okay now for my baby girl, as I change her diaper every time when it is wet.\nIf it is for older stage of baby, it might not be a good option as it is kind of thin.\nIt won't absorb as much, and might cause leakages."
            },
            "31": {
                "name": "Scientific Baking",
                "date": "Reviewed in the United States on December 28, 2024",
                "stars": "4.0",
                "title": "Nice diapers with fun design",
                "product_specs": "Color: Flower ChildSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Hello Bello Diapers are super cute with the flower design. They make it fun for your little one to wear. The diapers are soft. The ruffles around the leg openings are large and help prevent blowouts.\n\nIt is nice to have diapers on hand when taking care of our grandchild. This size range should last for quite awhile."
            },
            "32": {
                "name": "Reviewer",
                "date": "Reviewed in the United States on December 28, 2024",
                "stars": "4.0",
                "title": "Premium Diapers!",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Hello Bello Diapers have the cutest prints! I just love these diapers for my granddaughter. They are great for her sensitive skin and she has had no breakouts from them. The only downside is they are not as absorbent as other diapers we have used. So far she has not had any major leaks but I think as she gets older that could be a problem with these diapers. They seem a little skinnier than other diapers."
            },
            "33": {
                "name": "GummyCats",
                "date": "Reviewed in the United States on January 6, 2025",
                "stars": "4.0",
                "title": "Love these diapers, but not for nighttime.",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I love these diapers for daytime because they’re thin, seem far more comfortable for baby, and they’re adorable. But for nighttime they leak. So a more padded diaper for nighttime and these diapers for move-ability and comfort for the daytime.\nThese do not bother the baby’s skin at all whether it’s dry or wet which is amazing.\nI feel very comfortable with these diapers and this brand."
            },
            "34": {
                "name": "Jenna H",
                "date": "Reviewed in the United States on December 26, 2024",
                "stars": "4.0",
                "title": "Love the design",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "A design on a diaper isn't necessary but it adds a bit of fun to something that isn't always fun to take care of. These adorable flower prints bring a bit of whimsy to your day. Comparable to several diaper brands on a price per diaper although a bit higher than I try to go typically. We've had no issues with absorbency and they fit our little one well."
            },
            "35": {
                "name": "QuirkyGal",
                "date": "Reviewed in the United States on January 4, 2025",
                "stars": "4.0",
                "title": "Cute print, accurate sizing, underperform compared to Pampers",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers are cute and good, but do not hold as much liquid as Pampers or Kirkland brand. However, they are supposed to be made with safer materials, so the trade off depends on what you are looking for from a diaper. The sunflower print is super cute. I find that they can leak if you don’t change after one pee though. They are true to size. I like them over all, but wish the price point was lower considering performance."
            },
            "36": {
                "name": "Suzanne R. Arnholt",
                "date": "Reviewed in the United States on January 9, 2025",
                "stars": "4.0",
                "title": "They work",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are being used on a 5 month old baby, and they work as diapers should. They contain output and don't irritate the little one's skin. Seal easily, no problems."
            },
            "37": {
                "name": "Liz785",
                "date": "Reviewed in the United States on February 12, 2025",
                "stars": "5.0",
                "title": "Great Diapers",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "This is my first time trying HelloBello diapers for our baby, and so far so good! We haven’t had any diaper rash issues, and these hold a good amount of moisture - she can wear them through the night and there are no leaks. We have had a few blowouts, however we have learned they are unavoidable at times. They are nice and stretchy, and not too thick. The designs on the diapers are an added bonus, and the price is fair for a more premium diaper."
            },
            "38": {
                "name": "M.G",
                "date": "Reviewed in the United States on February 20, 2025",
                "stars": "5.0",
                "title": "Absorbent & Adorable!",
                "product_specs": "Color: Flower ChildSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Flower child is a simple and elegant design, appreciate the fact that these are chemical free. They are very gentle on my toddler's skin. No rashes its super soft and holds his pee well. Been using for almost a month, no leak yet. Good quality product."
            },
            "39": {
                "name": "StevenJM",
                "date": "Reviewed in the United States on February 10, 2025",
                "stars": "5.0",
                "title": "High quality",
                "product_specs": "Color: Flower ChildSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "High quality diapers from a good alternative to standard brands. Has all the features of the name brands with a softer feel. This particular version is very colorful with flowers on a pink background.\n\nThe tabs hold firm and the feel against the baby's skin is soft. The diapers hold liquid and solid waste very well. Decent price too."
            },
            "40": {
                "name": "Chrystal Cyhaung",
                "date": "Reviewed in the United States on February 4, 2025",
                "stars": "5.0",
                "title": "love those diaper",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "Hello Bello offers a value pack of their premium disposable baby diapers in Size 6, designed for babies weighing up to 35 pounds. This particular pack, featuring the charming \"Flower Child\" design, contains 68 diapers that are not only hypoallergenic but also crafted with a soft, cloth-like texture for enhanced comfort. Having purchased these diapers previously, I can confidently attest to their excellent quality, making them a reliable choice for parents seeking both functionality and gentleness for their little ones."
            },
            "41": {
                "name": "Bria",
                "date": "Reviewed in the United States on February 6, 2025",
                "stars": "5.0",
                "title": "Great diapers",
                "product_specs": "Color: Flower ChildSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "They’re super soft and gentle on my kiddos skin. They fit well and aren't too tight.\nThe design options are really cute too. These are surprisingly absorbent given how sustainable the brand is. I didn't expect this level of quality at all!\nI love that they’re hypoallergenic and have a very soft feel.\nWe really like these diapers for their moderate price point and their luxurious quality!"
            },
            "42": {
                "name": "Customer Review of Product",
                "date": "Reviewed in the United States on February 3, 2025",
                "stars": "5.0",
                "title": "Great diapers that do what they're supposed to",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers fit really well without being too binding. They were snug without leaving any marks on baby. Because they fit in all the right places, there was no leaking, and I was really pleased with the absorbency of the diapers. They are super soft, too, and feel good to the touch. Baby has had no issues with diaper rash or irritation with these diapers.\n\nThey are good looking, too! I'm buying some more for an expectant friend who fell in love with them!"
            },
            "43": {
                "name": "Mike",
                "date": "Reviewed in the United States on February 8, 2025",
                "stars": "5.0",
                "title": "very good",
                "product_specs": "Color: Wild CatsSize: Size 1",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Great diapers. The fit very well and looks like they stay in place. The absorbency is great and there were no leak issues. They feel very soft too touch. The material feels good on skin.\nThe print is a really nice addition too.\nConsidering you get 128 nappies in the pack I think they're pretty affordable.\nI'd definitely recommend them."
            },
            "44": {
                "name": "L. Hill",
                "date": "Reviewed in the United States on February 4, 2025",
                "stars": "5.0",
                "title": "Great diapers!",
                "product_specs": "Color: Wild CatsSize: Size 1",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are really great diapers, I am impressed at the value for the cost. They are soft, have cute patterns, they fit securely and comfortably, and we haven't had any issues with leaks using these, and stored moisture doesn't seem to get to places where it can cause irritation, if that makes sense. They are well designed, and we are very happy with them!"
            },
            "45": {
                "name": "Chickadee Chatter",
                "date": "Reviewed in the United States on February 5, 2025",
                "stars": "5.0",
                "title": "Hello Bello Diapers, Size 6 (35 lbs)",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These prints are super cute. They seem to fit comfortably and stay in place even with lots of movement. They prevent most leaks and do what they’re supposed to do. They’re kind of spendy, but diapers are kind of spendy and I like that these work well."
            },
            "46": {
                "name": "Jeanette",
                "date": "Reviewed in the United States on February 24, 2025",
                "stars": "5.0",
                "title": "Hello Bello",
                "product_specs": "Color: Flower ChildSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers have worked great. They seem comfortable and absorbent."
            },
            "47": {
                "name": "K K OBrien",
                "date": "Reviewed in the United States on January 24, 2025",
                "stars": "5.0",
                "title": "One of our favorite diaper brands!",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Love Hello Bello and recently sized up to 3s and have been super pleased with the bulk pack we were able to get. Always nice to have extras on hand! Of course the cute designs are a fun feature but more importantly these diapers are good where it really matters - comfort and absorbency!\n\nThese diapers are soft to the touch, structured perfectly to fit well and prevent leaks, and of course have a lot of power when it comes to absorbing pee! Overall these diapers have been great for us from infancy into the crawling stage where diapers really get put to the test with a wiggly and always moving baby!"
            },
            "48": {
                "name": "Joshua Tuano",
                "date": "Reviewed in the United States on January 23, 2025",
                "stars": "5.0",
                "title": "Comparible to Huggies-branded diapers",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "The diapers are pretty flexible and comfortable for my toddler. In terms of smell, it smells like your usual Huggies diaper, and is good at hiding odors and containing leaks.\n\nThe orange/yellow color is a nice touch, and the made in USA label gives an extra bit of confidence that this is a product made by someone who cares."
            },
            "49": {
                "name": "Miranda",
                "date": "Reviewed in the United States on November 24, 2024",
                "stars": "4.0",
                "title": "Hello Bello Premium Diapers",
                "product_specs": "Color: SunnysideSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These Hello Bello Premium Diapers come in a huge pack of 84 diapers. I got a size 4 and they fit well. They're absorbent and they seem comfortable to wear. They're hypoallergenic so they help with diaper rash. They have cute little designs on them. These would make a great gift for someone. They're also plant-based and safe to use on babies delicate skin."
            },
            "50": {
                "name": "CalmVibes",
                "date": "Reviewed in the United States on November 3, 2024",
                "stars": "4.0",
                "title": "Soft but not absorbent",
                "product_specs": "Color: SunnysideSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Pros:\n- Very soft\n- ⁠Cute design\n- ⁠No odor\n- ⁠The blowout barrier ruffles are very wide\n\nCons:\n- No wetness indicator (does not have the yellow/blue line that many other brands have)\n- ⁠Feels less absorbent. When I change my baby’s diapers after using these, his skin seems more irritated, red, and wrinkly than when using Huggies or Kirkland."
            },
            "51": {
                "name": "Caroline",
                "date": "Reviewed in the United States on February 2, 2025",
                "stars": "5.0",
                "title": "well absorb and soft diapers",
                "product_specs": "Color: Wild CatsSize: Size 1",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers are soft for my 3 month-old boy. They absorb well without any leak. The size runs well and tapes are strong for active babies moving a lot."
            },
            "52": {
                "name": "Adri Bee",
                "date": "Reviewed in the United States on February 7, 2025",
                "stars": "5.0",
                "title": "Diapers",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers have a cute floral deisgn, would be great to keep for your child, or even gifting as a baby shower present! There was no skin irritation, leakage, and they are a good quality for the price"
            },
            "53": {
                "name": "Crystal",
                "date": "Reviewed in the United States on January 21, 2025",
                "stars": "5.0",
                "title": "Amazing Quality Diapers",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers are simply amazing. I’ve struggled with other diapers and constant blowouts but haven’t had any issues with these. They have great absorbency and don’t seem to leak like other diapers I’ve experienced. They’re also very gentle on my toddler's skin and she is not irritated by them. They’re very soft and have a thick quilt like feel to them and fit perfectly. They also have cute designs although to me that doesn’t matter as much. They’re worth the extra cost for a high-quality diaper."
            },
            "54": {
                "name": "Bella Roberts",
                "date": "Reviewed in the United States on January 29, 2025",
                "stars": "5.0",
                "title": "No blowouts",
                "product_specs": "Color: Wild CatsSize: Size 1",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I really like these have so much protection against blowouts while being able to ensure that we are using health diapers on my newborn."
            },
            "55": {
                "name": "JSFox",
                "date": "Reviewed in the United States on January 2, 2025",
                "stars": "5.0",
                "title": "Great diapers, soft on baby skin",
                "product_specs": "Color: Flower ChildSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I've never tried this brand before and decided I'd check them out for my 19 month-old. The size 4 was true to size and the cute, bright colors and design were the first thing I noticed when I opened the box. They are all over a bright red/orange color with sunflowers all over. Super cute! I haven't had any problems with leaks (even after long days away from home with my baby when it's hard to get regular diaper changes done). Sometimes other brands I use have scratchy spots on the waistband that irritate my baby's skin, but I haven't noticed problems with these. The tabs for securing the diaper haven't torn or come off which is also nice to not have to deal with in the middle of a frantic, wiggly diaper change battle! I'd say these are definitely some of the better diapers I've used."
            },
            "56": {
                "name": "Mama Bean",
                "date": "Reviewed in the United States on December 31, 2024",
                "stars": "5.0",
                "title": "Durable, soft, catches the mess",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "As a mom, grandma, and child care provider I have made a life and career out of changing diapers. I've used all kinds of brands at all kinds of price points, and have definite preferences for specific brands and details about diapers. The material they're made from is fragrance free, not easy to tear (the instant rage that comes from accidentally tearing off a tab? omg) and is super soft. I haven't had any major instances of leakage or blowouts as of yet, but hopefully they will be up to the challenge. The print on them is very cute, too. Thus far I am pleased with the quality of these diapers, and hope to continue to be in the future."
            },
            "57": {
                "name": "Katie",
                "date": "Reviewed in the United States on February 2, 2025",
                "stars": "5.0",
                "title": "Good product",
                "product_specs": "Color: Wild CatsSize: Size 1",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Love these diapers! These are a great product and hold up really well. Glad to have them!"
            },
            "58": {
                "name": "Honest Reviewer",
                "date": "Reviewed in the United States on January 10, 2025",
                "stars": "5.0",
                "title": "Great quality and cute",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are a nice quality and hold well. My son frequently has loose stools and we have not had any blowouts. I do think next time I am going to size up though. He is only 24 pounds but we typically use Walmart's brand of diapers and these fit slightly more snug. I cannot speak for the smaller sizes but they're not quite as soft as I would expect out of a higher end diaper."
            },
            "59": {
                "name": "Steph",
                "date": "Reviewed in the United States on January 26, 2025",
                "stars": "5.0",
                "title": "Good quality diapers",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I picked this up for an infant in my life, and mama is very happy with these. They are quite absorbent and, so far, no reports of any leakage, much like other diapers on the market. What sets these apart is the fun design, it just adds a little bit of levity to diaper changing time."
            },
            "60": {
                "name": "K.",
                "date": "Reviewed in the United States on January 13, 2025",
                "stars": "5.0",
                "title": "Very Absorbent - Cute Design",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers work great! They’re super absorbent and keep leaks at bay, even overnight, which is a big deal for us. The soft, cloth-like material feels gentle on my child’s sensitive skin, and we haven’t experienced any irritation or rashes. I also love the cute design - it adds a fun touch to diaper changes. Overall, they’re reliable, comfortable, and worth the investment!"
            },
            "61": {
                "name": "Painter Person",
                "date": "Reviewed in the United States on January 15, 2025",
                "stars": "5.0",
                "title": "Did the job",
                "product_specs": "Color: Flower ChildSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Ordered these to have on hand as extras for when some of our little ones come visiting. These are whimsical (cute design!) and they did hold in the \"deposits\" during our visiting times. Can't speak about overnights or long trips with them, but they surely did well during use during hours-long visits and I am glad to have them on hand!!"
            },
            "62": {
                "name": "Lady Love Dr",
                "date": "Reviewed in the United States on January 20, 2025",
                "stars": "5.0",
                "title": "Great diapers",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers are amazing. I really like them. There were no leaks and they seemed very comfortable for my little guy. They absorbed a lot and were easy to get in and off. Great value."
            },
            "63": {
                "name": "Sasha",
                "date": "Reviewed in the United States on January 29, 2025",
                "stars": "5.0",
                "title": "Favorite Diapers",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers are just as good as any name brands out there. They handle blowouts and multiple pees during the night!"
            },
            "64": {
                "name": "Retired Rosie",
                "date": "Reviewed in the United States on January 6, 2025",
                "stars": "5.0",
                "title": "Best diapers ever",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Two years ago, I found Hello Bello diapers at a local store. They were grinch decorated so I just had to get them for my new grand baby. We haven't looked back since. Hello Bello and the Honest brands are the BEST disposables we've tried. They don't leak, hold a LOT and have never caused a rash. We actually tried a more expensive, supposedly organic brand real cotton brand that caused a rash on the baby. we didn't think it could be them until after 2 dr visits and the only thing left was the diapers.\n\nThe Hello Bello (and Honest) brand is wonderful! Once you try them and your baby does well with them, it's not worth chancing a rash or an allergy to save a few pennies, or to even spend more. When you find something that works, stick with it! That's what we're doing!"
            },
            "65": {
                "name": "Jeff C",
                "date": "Reviewed in the United States on January 14, 2025",
                "stars": "5.0",
                "title": "Good Quality Diapers",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Good quality on par with other name brands."
            },
            "66": {
                "name": "cirkatianrhythm",
                "date": "Reviewed in the United States on January 7, 2025",
                "stars": "5.0",
                "title": "Diapers",
                "product_specs": "Color: Wild CatsSize: Size 1",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I purchased these to donate to my local food pantry so I don't have firsthand experience to share, but I can say that they look to be very high quality. Pattern is bright and cute and the diaper seems soft."
            },
            "67": {
                "name": "BillRVC",
                "date": "Reviewed in the United States on January 12, 2025",
                "stars": "5.0",
                "title": "The do what diapers are supposed to do",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "The fit was good with my one year old grand daughter. The printed characters are cut though that doesn't really matter. They stood up well to what she could deliver."
            },
            "68": {
                "name": "CustomWebProgrammer",
                "date": "Reviewed in the United States on January 3, 2025",
                "stars": "5.0",
                "title": "Hypoallergenic Is Very Helpful",
                "product_specs": "Color: Flower ChildSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I volunteer for a charity that provides diapers to needy families. We receive requests and information about certain diapers causing skin irritations on babies’ little bottoms. I was tasked with finding hypoallergenic diapers online. I not heard of this brand of diapers before. The value was good for the money available. When compared to other diapers of the same size, the size and rip resistance were good. A client appreciated these extra effort to helping her daughter and the skin protection was much better. Our organization is planning to order more. I find the design much cuter than other diapers online brands."
            },
            "69": {
                "name": "De N",
                "date": "Reviewed in the United States on January 11, 2025",
                "stars": "5.0",
                "title": "So much cuter than plain white diapers",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers are soft and about as absorbent as other brands. They look much cuter than plain white diapers. They stay on well while baby is playing around the house. I plan to order more of these."
            },
            "70": {
                "name": "Momma 🐝",
                "date": "Reviewed in the United States on January 10, 2025",
                "stars": "5.0",
                "title": "Great diapers",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These hold up well overnight (no leaks or rips). Securing easily and staying secured. The fit seems to be comfortable and the best part is, they're clean! No yucky chemicals."
            },
            "71": {
                "name": "JM",
                "date": "Reviewed in the United States on January 4, 2025",
                "stars": "5.0",
                "title": "Very nice diapers",
                "product_specs": "Color: Wild CatsSize: Size 1",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "As someone who has been loyal to a single brand of diaper, I am very happy to report that these diapers work very well, and do not cause any kind of diaper rash or issues. They fit well and accommodate a significant amount of growth thanks to the saysing design. They also have not caused any irritation and seem to soak up liquids very well and quick enough to prevent leakage so far. I also think the little tiger design is super cute. Overall I’m very happy with the quality."
            },
            "72": {
                "name": "Amazon Customer",
                "date": "Reviewed in the United States on December 30, 2024",
                "stars": "5.0",
                "title": "Size 4 diapers",
                "product_specs": "Color: Flower ChildSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "At this size of diaper most children are very mobile.\n\nI'd compare this diaper to a more natural and cuter pampers swaddler. It is definalty adequate for most littles with no leaks, it is best for pre potty trained as the tabs still give the diaper feel, price is ok for a natural diaper but there are cheaper options our there, quality is great, pattern is cute, since it's natural materials it's good for senstive skin, diaper is of similar thickness to huggies natural care so it shouldn't be bothersome, no leaks so far, stretchy enough to handle movement of.toddler."
            },
            "73": {
                "name": "PDP",
                "date": "Reviewed in the United States on December 21, 2024",
                "stars": "5.0",
                "title": "Cute Wild Cats Print Design – Good Adhesive Tabs – Soft & Gentle On Skin",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I think these Wild Cats themed Hello Bello diapers are pretty nicely designed. The adhesive tabs appear to work well. The soft padded material is gentle on the skin and seems to be reasonably absorbent. The elastic around the legs has a good amount of stretchiness to it, and it seems to provide for a decent fit that would help prevent leaks. The printed Wild Cats design is fun, and it’s a nice change from the plain white diapers we normally see.\n\nI am keeping a few of these on hand for when my nieces and nephews visit. The rest are going in a gift basket I’m putting together for my sister who had a little girl a couple months ago. It may be a while before she can use these, but babies grow so quickly, and having a good range of diaper sizes available will be very helpful for her. I’m happy with the apparent quality of these diapers, to the extent that I’ve been able to test their absorbency, the adhesive tabs, and feel how soft they are. I think these are a pretty reasonable value for a pack of 100."
            },
            "74": {
                "name": "B. Bender",
                "date": "Reviewed in the United States on January 9, 2025",
                "stars": "5.0",
                "title": "Very cute",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers are very cute, I love the design on them. They work well and just like I expected. I like that the legs have two rows of elastic but still very soft."
            },
            "75": {
                "name": "Nate",
                "date": "Reviewed in the United States on December 23, 2024",
                "stars": "5.0",
                "title": "Good value for 100-pack",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers work as well as any others I’ve used. I personally don’t have kids, but I have 3 nephews (and one on the way) who use them. So I got them to keep on hand when they visit or I babysit. So while, I’m no diaper expert, I’ve had no issues with these. They fit nicely and hold any messes. I’ve not had any issues with leaking or irritation. I know enough to realize diapers can be quite pricey, so I think these are definitely a good value for a 100-pack.\n\nThanks for reading my review. I hope you found it helpful."
            },
            "76": {
                "name": "MarkNotMarc",
                "date": "Reviewed in the United States on January 9, 2025",
                "stars": "5.0",
                "title": "Soft, Cute, and Reliable!",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Hello Bello diapers are fantastic! They’re super soft and form perfectly around my baby’s legs for a secure fit. The designs are adorable, and best of all, we haven’t had a single blowout since we started using them—even though we’ve had a few close calls! These are now our go-to diapers for comfort and reliability. Highly recommend!"
            },
            "77": {
                "name": "haunted S",
                "date": "Reviewed in the United States on January 14, 2025",
                "stars": "5.0",
                "title": "premium disposable diapers",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "this is well made and the quality is good. It does contain pee and poop well. Have been using for a month and no complaints yet. the packaging was really good too."
            },
            "78": {
                "name": "Mulberry",
                "date": "Reviewed in the United States on January 10, 2025",
                "stars": "5.0",
                "title": "Definitely soft!",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "First time using the Hello Bello Diapers size 5 for 27+ lbs. The design was a fun and bright lion and tiger print. I love the softness of this brand along with the double leakproof protection around the legs. Has a wetness indicator stripe that runs along the backside and up the front of the diaper. The overall softness without the plastic is what sold me on this product. Made in USA."
            },
            "79": {
                "name": "Sterling",
                "date": "Reviewed in the United States on January 4, 2025",
                "stars": "5.0",
                "title": "Nice",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I like that they're natural and hypoallergenic. Very soft material and doesn't seem to bother my baby at all. Comes in a 100 pack, which seems like a great amount, till you start going through them. I still like Huggies, but these were nice to try."
            },
            "80": {
                "name": "Austin Cho",
                "date": "Reviewed in the United States on November 3, 2024",
                "stars": "4.0",
                "title": "Came with good amount for money, no leaks",
                "product_specs": "Color: SunnysideSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "This came with a healthy amount of diapers and they didn’t leak at all."
            },
            "81": {
                "name": "G. Baggett",
                "date": "Reviewed in the United States on January 14, 2025",
                "stars": "5.0",
                "title": "Really Nice!",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I really liked these diapers. They were very absorbent, easy to put on, and didn't seem uncomfortable or to bother my 2-year-old daughter. I will buy more of these."
            },
            "82": {
                "name": "LNM",
                "date": "Reviewed in the United States on December 28, 2024",
                "stars": "5.0",
                "title": "Cute and work well",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I love the flower design on these. They are absorbent and feel soft to the touch. Pricey but I can see why they're considered premium."
            },
            "83": {
                "name": "Tyler",
                "date": "Reviewed in the United States on January 15, 2025",
                "stars": "5.0",
                "title": "Well made, cute patterns!",
                "product_specs": "Color: Wild CatsSize: Size 1",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Awesome diapers, hold in all the messes! Pretty easy to get off and on and feels high quality. Cute designs too! Feels just as good if not better than the other big brands."
            },
            "84": {
                "name": "Simon",
                "date": "Reviewed in the United States on January 18, 2025",
                "stars": "5.0",
                "title": "No More Leaks",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Fits very well, my toddler had several big poops in there and never leaked. The print is also cute. The thickness is just right."
            },
            "85": {
                "name": "Jen",
                "date": "Reviewed in the United States on January 3, 2025",
                "stars": "5.0",
                "title": "Soft",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers are so soft, and compare also to Millie moon for a fraction of the price. We have not had any blowouts or leaks and the pad is thick! They are good quality and fit my baby super well. My only gripe is that the bright color does show through light colored clothing. But overall these are great and work well!"
            },
            "86": {
                "name": "JJB",
                "date": "Reviewed in the United States on January 6, 2025",
                "stars": "5.0",
                "title": "So cute!",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Our first grandchild is coming in a few short months and seeing these cute diapers, I couldn’t resist ordering. Of course, I am unable to address performance at this time, but I can say that they feel very soft, have no fragrance (which we prefer), and are so cute. I will update on our experience with using them after the baby arrives and grows into these size 3, which I’m sure won’t take long!"
            },
            "87": {
                "name": "Kindle Customer",
                "date": "Reviewed in the United States on December 20, 2024",
                "stars": "5.0",
                "title": "Nice and soft!",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are really cute little diapers, if not a bit girly, but considering what they're used for, does it really matter?\n\nI like that they are nice and soft, and the velcro-type fasteners will make it easy to adjust as needed, ensuring a good fit."
            },
            "88": {
                "name": "Destiny",
                "date": "Reviewed in the United States on December 31, 2024",
                "stars": "5.0",
                "title": "Perfect for little one!",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Very absorbent! Fits to size and seems to be of good quality. Overall would recommend for mamas needing new diapers for their little ones!"
            },
            "89": {
                "name": "Erika H",
                "date": "Reviewed in the United States on January 4, 2025",
                "stars": "5.0",
                "title": "Absorbent",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers are soft and absorbent. We haven’t had any issues with leaks or ‘explosions’ while using this brand. I love the fun pattern. It hasn’t caused any issues with my baby’s sensitive skin, so it’s a win!"
            },
            "90": {
                "name": "a human being",
                "date": "Reviewed in the United States on January 2, 2025",
                "stars": "5.0",
                "title": "Work great",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "My toddler is transitioning out of diapers but we still needed one more box to have on hand, and these work perfectly. They’re thin enough to fit my very active toddlers body while still absorbent enough to hold the pee from their growing bladder. They’re very soft and we haven’t had any irritation marks anywhere, which is a nice change from some of the pull-ups out there that make my kiddos hips itch. The pattern is very cute as well, though maybe more geared towards girls if you care about such things."
            },
            "91": {
                "name": "PurpleAce",
                "date": "Reviewed in the United States on January 13, 2025",
                "stars": "5.0",
                "title": "Nice diapers",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I like how it comes with so many and it’s a good price. I got these for a diaper raffle for a baby shower."
            },
            "92": {
                "name": "Karen R. Dailey",
                "date": "Reviewed in the United States on October 7, 2024",
                "stars": "4.0",
                "title": "High quality diapers - but you pay for it!",
                "product_specs": "Color: SunnysideSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "We are very pleased with these in terms of quality. They are durable, very absorbent, great fit, and have a fun design. If you want a top notch diaper for your kiddo, these are perfect for you (especially with the hypoallergenic and eco-friendly perks). The one drawback is the price. We will probably continue to use our more budget friendly brand, but can't deny how good these are!"
            },
            "93": {
                "name": "DRW",
                "date": "Reviewed in the United States on December 24, 2024",
                "stars": "5.0",
                "title": "Work great",
                "product_specs": "Color: Flower ChildSize: Size 4",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These work as well as most other diapers, but have neat little designs on them. Overall, I'm pleased with the performance and haven't experienced any leaks or issues."
            },
            "94": {
                "name": "Mary",
                "date": "Reviewed in the United States on December 28, 2024",
                "stars": "5.0",
                "title": "Good Quality",
                "product_specs": "Color: Flower ChildSize: Size 2",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are good diapers. I like the print and they have been holding up well. They are not high end but are good for the price."
            },
            "95": {
                "name": "OneByOne",
                "date": "Reviewed in the United States on October 14, 2024",
                "stars": "4.0",
                "title": "good quality",
                "product_specs": "Color: SunnysideSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Hello Bello Premium Diapers Size 5 I 18 Count (Pack of 4) Disposable, Extra-Absorbent, Hypoallergenic, and Eco-Friendly Baby Diapers with Snug and Comfort Fit I SunnySide Up Pattern Value Pack (72 CT)\n\nThe diaper was soft and absorbed well.\nThe fit can be adjusted by the velcro."
            },
            "96": {
                "name": "Manila Mike",
                "date": "Reviewed in the United States on January 4, 2025",
                "stars": "5.0",
                "title": "MAXimum Protection",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Max has no complaints with these Hello Bello Diapers. The fit is great. No signs of discomfort. The waist and leg stretch systems are flawless. The velcro-like fasteners hold and re-hold well. We have not encountered a load that these diapers could not adequately accommodate but still go with others for night-time use. Even the Wild Cat design puts a smile on Max's face."
            },
            "97": {
                "name": "Jon",
                "date": "Reviewed in the United States on December 22, 2024",
                "stars": "5.0",
                "title": "Works!",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "The Hello Bello Diapers, Size 6 (Flower Child) are like a stylish and comfy upgrade for your baby’s bottom. With their adorable flower design and super soft, cloth-like feel, these diapers are perfect for keeping your little one both comfortable and fashionable. The hypoallergenic materials make them a great choice for sensitive skin, ensuring a rash-free experience even during extended wear.\n\nThese diapers provide excellent absorbency, handling nighttime accidents or those “extra-special” moments with ease. The stretchy sides and secure tabs make for a snug, yet breathable fit that keeps up with all the wiggling, crawling, and running your baby can muster.\n\nI used these for my toddler, and they held up impressively through all sorts of activities, from wild playtime to peaceful naps. Plus, the flower pattern added a bit of fun—because who says diapers can’t be cute?\n\nIf you’re looking for reliable, eco-conscious diapers that don’t sacrifice style for performance, this value pack is a fantastic choice. Just be ready to hear, “Where did you get those adorable diapers?” during your next playdate!"
            },
            "98": {
                "name": "Twin Mom",
                "date": "Reviewed in the United States on January 15, 2025",
                "stars": "5.0",
                "title": "Great diapers!",
                "product_specs": "Color: Flower ChildSize: Size 6",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers work really well and do not irritate the skin. Very pleased!"
            },
            "99": {
                "name": "Megan Elle",
                "date": "Reviewed in the United States on December 22, 2024",
                "stars": "5.0",
                "title": "Great diapers.",
                "product_specs": "Color: Wild CatsSize: Size 3",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are great diapers. Nice quality. The sizing is correct. Cute pattern. No leakage. Easy to use during a diaper change. And a nice value for the price."
            },
            "100": {
                "name": "Rob",
                "date": "Reviewed in the United States on January 2, 2025",
                "stars": "5.0",
                "title": "Hello Bello",
                "product_specs": "Color: Wild CatsSize: Size 5",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Hello Bell has the cutest prints! They are very absorbent & you don’t have to deal with leaks unlike some diaper brands."
            }
        }
    },
    "2": {
        "product_name": "Baby Diapers - Size 1 (4-11 lbs), Monthly Supply (224 Count), Leak Protection, Skin-Friendly, Ultrasoft, Perfume- & Chlorine-Free, Hypoallergenic, dermatologically tested, OEKO-TEX®",
        "url": "https://www.amazon.com/LILLYDOO-Diapers-Skin-Friendly-Chlorine-Free-Absorbent/dp/B0D65YXGQV/ref=sr_1_2_sspa",
        "reviews": {
            "1": {
                "name": "Büşra iplikci",
                "date": "Reviewed in the United States on February 22, 2025",
                "stars": "5.0",
                "title": "Works as good as bestselling brands",
                "product_specs": "Size: 5Unit Count: 144.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "I have been using the the best selling diaper brand for more than a year but they kept leaking during the night. So rather than paying that amount I was in search of a mire affordable but working well diapers. I came across this brand and decided to give it a try. I saw earlier comments says it leaks but it was on sale and I said lets try this. Yes they are thin diapers but it doesn’t mean they will leak. Actually worked way more better than the best selling brand we have been using. I also like the texture it is so soft. I will follow for sales👍🏻"
            },
            "2": {
                "name": "Melanie",
                "date": "Reviewed in the United States on January 25, 2025",
                "stars": "5.0",
                "title": "5 star customer service",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "2 people found this helpful",
                "review": "The seller was attentive to my review and offered a refund. I appreciate their customer service and willingness to make it right, I guess you could say. 5 stars for customer service. I Iike how soft these are and the material they are made of but for some dumb reason there is a channel all throughout the diapers where the material is that would otherwise soak up pee. Why would you skimp on the absorbant part of a diaper?\n\nWe realized this when our baby had diarrhea and it kept leaking out the sides of the diaper. Also the tabs to close the diaper are kind of narrow and small so the front of the diaper gets kinda wonky if your baby likes to move around. If these two things weren't an issue I'd give 5 stars and purchase again. But for now we will go back to huggies."
            },
            "3": {
                "name": "CoCo",
                "date": "Reviewed in the United States on September 25, 2024",
                "stars": "1.0",
                "title": "Not good.",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "22 people found this helpful",
                "review": "I hate to give small businesses bad reviews but these are not good. The diaper on the left is the lily moon. I put it next to another size 5 diaper (dyper brand). It is very thin. You can see through it. I tried this and these were blow out central. Possibly because they run smaller than average size 5. My baby is not chunky. He’s average size for his age and these were small. If you get them definitely size up especially if you have a chunky kiddo. They were fine for pee but you’ll definitely change them a lot as they are quite thin. They didnt seem to keep him as dry as I prefer. Overall I did not really like anything about them. I was trying to find something cheaper but good enough these won’t work. Honest diapers are better than these and those to me aren’t good. I tried to be as thorough as possible because these are things I was looking for in reviews. I hope this business can take this review into account and make the diapers better."
            },
            "4": {
                "name": "c",
                "date": "Reviewed in the United States on February 6, 2025",
                "stars": "4.0",
                "title": "really soft!",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "I love this diaper... but my baby des not.\nthe diaper is very soft both inside and out. it is gentle on my baby's skin. it also appears very absorbent. The issue for the baby.... she wants to be change more frequently so we are going through diapers much faster than usual. She wakes up everything she wets."
            },
            "5": {
                "name": "Kelsey",
                "date": "Reviewed in the United States on January 30, 2025",
                "stars": "5.0",
                "title": "Great buy - no leaks!",
                "product_specs": "Size: 3Unit Count: 88.0",
                "verified_purchase": true,
                "helpful_statement": "5 people found this helpful",
                "review": "Wow! Great product. Was hesitant to try at first because some other reviews said the diapers were thin and leaked. I decided to buy some anyways and give it a try because of the price and how these diapers were made with cleaner ingredients. So glad I bought a box! We've been using them for a month now and we've had NO issues so far. While they do seem thinner than other diapers, but there have been no leaks or blowouts. The price right now is amazing. They're also made with a cute simple print print design as well. Will definitely keep buying!"
            },
            "6": {
                "name": "Elizabeth Love",
                "date": "Reviewed in the United States on February 16, 2025",
                "stars": "2.0",
                "title": "No thanks",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Not really a fan or these. I’m one of those moms that constantly change diapers. I’m not leaving it on in order to save money and the reason I’m not a fan is 1) they don’t have a pre indicator. You know how some other diapers have a line that changes color to indicate wetness. This does not have that at all. These feel like a cheap plant material used. I’m all for helping the environment but not if I have to use 10x more diapers…\n2) it just doesn’t feel like an absorbent product. Her skin always feels wet.\n3) not the best for overnight. She now sleeps through the night so I don’t get up as often but when I do it’s because she’s peed through the diaper because it’s not that absorbent. Gotta constantly change them anyway.\nI gave 2 stars because I didn’t want to be “mean”… but yeah we aren’t buying these again. They are 💩 diapers."
            },
            "7": {
                "name": "Brooke P.",
                "date": "Reviewed in the United States on January 15, 2025",
                "stars": "3.0",
                "title": "They are OKAY",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "3 people found this helpful",
                "review": "I really wanted to love these but they are just okay. I usually use Millie Moon but don’t like that they aren’t TCF , plus these were a price I couldn’t turn down! My little is 8 weeks, in a size 2. I have been using these for 3 days during the day only. I do not trust them enough for night time. So far I have had 2 leaks with these.\n\nHere’s how they compare to Millie Moon diapers:\n1) Not as soft but softer than pamper swaddlers\n2) Doesn’t seem to hold as much urine and clothes seem to get damp… I change diapers at a minimum every 2 hours … with these it seems less.\n3) super thin and not as bulky\n4) super stretchy but still not a tight fit on his bum\n\nI have 175 diapers + to change my mind and will update if needed."
            },
            "8": {
                "name": "J",
                "date": "Reviewed in the United States on February 20, 2025",
                "stars": "5.0",
                "title": "Good diaper",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "2 people found this helpful",
                "review": "I've gotten these diapers before but got the special price this time and you can't beat it. They are soft and nice quality. They do not irritate my babies skin like other diapers do and I do not have any leaking issues."
            },
            "9": {
                "name": "ianimus",
                "date": "Reviewed in the United States on November 18, 2024",
                "stars": "4.0",
                "title": "Work very well, not perfect",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "12 people found this helpful",
                "review": "We started using Lillydoo diapers with our latest baby who is now 5 mo. They have worked really well for him. They are not perfect (they will leak once they reach capacity...duh) and as your baby grows you'll need to be ready to size up regularly. We cloth diaper at home and use Lillydoo diapers when we are out and at night and we have had to size up after using 80-160 diapers (currently using size 4). Our little guy is on the large side for his age. Please consider that babies come in all shapes and sizes so what works for one baby may not work for others. I do recommend to try them as they are economical and a premium quality."
            },
            "10": {
                "name": "Heidi",
                "date": "Reviewed in the United States on February 20, 2025",
                "stars": "5.0",
                "title": "Great diapers!",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "The deal than ran on these was amazing! Now our new favorite diaper. My girl’s sensitive skin is happy. I will say I feel like they may run a tad smaller than other generic brands but that works in our favor actually:)"
            },
            "11": {
                "name": "Avy Elder",
                "date": "Reviewed in the United States on January 31, 2025",
                "stars": "5.0",
                "title": "! Great Quality Diaper !",
                "product_specs": "Size: 2Unit Count: 100.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "I was skeptical at first because of some of the reviews. However, even though these diapers are on the thinner side, they are great quality, very soft, and hold a good amount without leaking. I haven’t had any bad experiences thus far, hence the 5 star rating. The value for the money is also a huge plus for me! I use honest diapers which are a little more pricey, so to find another quality diaper that is clean and sensitive skin friendly is great :)"
            },
            "12": {
                "name": "anna",
                "date": "Reviewed in the United States on January 17, 2025",
                "stars": "4.0",
                "title": "Not too absorbent but does the job",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "2 people found this helpful",
                "review": "Good quality, just doesn’t seem to be as absorbent as some of the more popular brands! Got a good price/deal so definitely worth it."
            },
            "13": {
                "name": "ANB",
                "date": "Reviewed in the United States on January 14, 2025",
                "stars": "5.0",
                "title": "Diaper can be wrapped and fitted well",
                "product_specs": "Size: 1Unit Count: 224.0",
                "verified_purchase": true,
                "helpful_statement": "4 people found this helpful",
                "review": "I guess some will just think this diaper is thin and won’t hold messes? I don’t feel newborns eliminate large amounts and their diapers are getting changed often.\nI am using newborn diapers on a tiny mauled dog who is energetic! I can wrap this thin yet durable diaper to stay on my live wire.\nI’m retired and part of my career was newborn nursery. We had to be creative with placing diapers on preemies .\nParents are tired and we certainly don’t want having to reposition a diaper.\nThis diaper is easier to form around baby with great tabs. It may not be absorbent enough for a toddler, but accidents through diapers are often with poor placement."
            },
            "14": {
                "name": "Yolanda Jaimes Castaño",
                "date": "Reviewed in the United States on February 25, 2025",
                "stars": "5.0",
                "title": "Funcionales para lo que los compre",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Yo uso panal de tela por dentro, pero sin embargo no me le provocan alergias dermicas a mi bebe"
            },
            "15": {
                "name": "Beth Miller",
                "date": "Reviewed in the United States on February 17, 2025",
                "stars": "5.0",
                "title": "My new favorite.",
                "product_specs": "Size: 5Unit Count: 144.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "I started using these pampers and I would never go back. I haven’t had any issues with the leaks and they seem to keep my baby dryer till morning."
            },
            "16": {
                "name": "Laurie Fishers",
                "date": "Reviewed in the United States on February 24, 2025",
                "stars": "5.0",
                "title": "Great price",
                "product_specs": "Size: 2Unit Count: 100.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "This is part of a gift and very happily with my purchase"
            },
            "17": {
                "name": "Danelia G.",
                "date": "Reviewed in the United States on February 16, 2025",
                "stars": "5.0",
                "title": "Buenisimo",
                "product_specs": "Size: 2Unit Count: 100.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "A mi bebé le fue muy bien no se le sale y está toda la noche sin cambiarle el pañal"
            },
            "18": {
                "name": "V.A.",
                "date": "Reviewed in the United States on September 20, 2024",
                "stars": "4.0",
                "title": "Best Diapers",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "5 people found this helpful",
                "review": "I did a lot of diaper research before baby was born and didn't even hear of these. Baby was born early 4 mo ago and most diapers didn't fit him, and premie were hard to find. These were found after even more searching by \"ingredients\" and I tried them since the price was fair. They are better than leading brands! They hold up great, they're thin but not so thin they leak, and they fit for a while so they fit small babies and larger babies! They move with baby, too! I have yet to get diaper wash between these and Babycozy wipes while letting baby air dry a few seconds before next diaper is closed. Will purchase for a while."
            },
            "19": {
                "name": "Katlin",
                "date": "Reviewed in the United States on January 26, 2025",
                "stars": "5.0",
                "title": "So soft!",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "L I absolutely love these diapers for my daughter. The only problem is, when she was a newborn and around 6 pounds they were still too large for her. I wouldn’t recommend them for babies that tiny! But now that she’s bigger, the coverage is so great! Absolutely no blowout."
            },
            "20": {
                "name": "Emmelie",
                "date": "Reviewed in the United States on November 1, 2024",
                "stars": "5.0",
                "title": "Finally available in the US!",
                "product_specs": "Size: 3Unit Count: 88.0",
                "verified_purchase": true,
                "helpful_statement": "18 people found this helpful",
                "review": "I‘ve used these diapers 6 years ago with my daughter while living in Germany. I tried so many brands and this one was the only one not giving her rashes, but also keeping her dry during day and night! We rarely had any blowouts.\nNow, with my youngest, I was looking for something TCF, but also absorbent and affordable. I like a couple of different brands, but haven’t been able to find anything TCF that would last over 12h during the night. So when these diapers became available in the US, I got excited.\nAfter almost 7 years I only remembered really loving them.\nHere’re my thoughts after trying them again:\nMy initial thought was that I don’t remember them being so thin! I also thought they used to be softer and felt less like plastic back then.\nBut after putting them on over night, I love them just like I used to. They are very absorbent and pull the wetness away from the baby. They won’t feel as thin once you change baby and I like how, especially during the night, baby doesn’t have to wear a super thick diaper.\nGranted, they feel more like plastic than for example pu*a diapers (orange packaging), but they’re OEKO Tex certified and TCF, so I’m okay with it, especially since it’s not like that inside. I’ll be buying again and hope they’ll soon have more cute designs available like they do in Germany!"
            },
            "21": {
                "name": "Brenna",
                "date": "Reviewed in the United States on February 25, 2025",
                "stars": "3.0",
                "title": "Fits well, issues with leaks",
                "product_specs": "Size: 2Unit Count: 100.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Great fit and stretch for chunky baby thighs. We did have a problem with leaks, however. Had a urine leak when used overnight and doesn’t stand a chance against blowouts regardless of the length of time worn."
            },
            "22": {
                "name": "Bee",
                "date": "Reviewed in the United States on February 15, 2025",
                "stars": "5.0",
                "title": "Great product!",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "No rash! No scent! Great quality diaper for a reasonable price!"
            },
            "23": {
                "name": "Faith",
                "date": "Reviewed in the United States on February 10, 2025",
                "stars": "5.0",
                "title": "Best diapers at a fraction of the price",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These diapers are outstanding! I love how soft they are and extremely well priced."
            },
            "24": {
                "name": "Priscilla mead",
                "date": "Reviewed in the United States on November 27, 2024",
                "stars": "4.0",
                "title": "Excellent diapers",
                "product_specs": "Size: 2Unit Count: 100.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "These diapers were excellent for daytime use. They were very absorbent, thin, and stayed on very well. We did use a heavier diaper for night time use"
            },
            "25": {
                "name": "maygaribay",
                "date": "Reviewed in the United States on January 21, 2025",
                "stars": "3.0",
                "title": "Okay diapers",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "I like how the diapers are clean of everything but they are poor quality diapers, they are so thin and falls off so easily looks like he’s always sagging. For the value also wouldn’t recommend, would rather spend a little extra for better quality tbh"
            },
            "26": {
                "name": "Scmb",
                "date": "Reviewed in the United States on November 24, 2024",
                "stars": "4.0",
                "title": "Soft, no rashes",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Great option for a TCF diaper for newborn, fit well and minimal leaks."
            },
            "27": {
                "name": "Rhonda Crockett",
                "date": "Reviewed in the United States on January 21, 2025",
                "stars": "5.0",
                "title": "Love this brand",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "At first I thought they were super thin, BUT when I used them they didn’t leak and even held VERY well overnight. Definitely prefer this brand to Huggies or pampers."
            },
            "28": {
                "name": "Melissa Kozlowski",
                "date": "Reviewed in the United States on November 19, 2024",
                "stars": "4.0",
                "title": "Good Diapers",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Great for daily use, wouldn't recommend for night time sleeping."
            },
            "29": {
                "name": "Alexis Beane",
                "date": "Reviewed in the United States on September 20, 2024",
                "stars": "4.0",
                "title": "Great clean diaper but size up!",
                "product_specs": "Size: 5Unit Count: 144.0",
                "verified_purchase": true,
                "helpful_statement": "5 people found this helpful",
                "review": "We really love these diapers and the ingredients but they do run small so I suggest sizing up one or 2! They are very clean and have no issues with leaks or blowouts- usually don't wear at night though! Customer service went above and beyond to correct our issue too- which is always a plus with a company ☺️"
            },
            "30": {
                "name": "Amazon Customer",
                "date": "Reviewed in the United States on February 2, 2025",
                "stars": "5.0",
                "title": "Price",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Best price and quality!"
            },
            "31": {
                "name": "Muy bien producto, mejor de lo que se ve. Aún que al cargador le falta mejor calidad de resto excelente para mi hijo de 6 años ❤️",
                "date": "Reviewed in the United States on February 2, 2025",
                "stars": "5.0",
                "title": "Muy buenos",
                "product_specs": "Size: 3Unit Count: 88.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Son exelentes"
            },
            "32": {
                "name": "Cassandra Elworthy",
                "date": "Reviewed in the United States on January 9, 2025",
                "stars": "2.0",
                "title": "Tired of doing extra Laundry",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "5 people found this helpful",
                "review": "I REALLY REALLY wanted to love these diapers. They’re soft on skin, SEEM to fit well, and the dandelion print is cute. But this entire week I have spent the hour upon waking cleaning poop off sheets and clothes. They do not contain blow outs AT ALL. I prefer Walmart brand or honest brand to these. Disappointed.\n\nUPDATE, changing my rating to 3 stars: best customer service I have dealt with in a while. They reached out to me and showed empathy as well as understanding. 5 stars for the company and its team, still feeling unsure in regards to diapers. Hoping my toddler will do better in them than my 10 month old (I bought two boxes at once, haven’t opened the size 6 diapers yet, only the size 4)"
            },
            "33": {
                "name": "Lauren Dozier",
                "date": "Reviewed in the United States on January 11, 2025",
                "stars": "3.0",
                "title": "Price is great, but you’ll pay for blowouts",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Not very durable, did experience some leakage. I do like how stretchy the tabs are."
            },
            "34": {
                "name": "lisa duong",
                "date": "Reviewed in the United States on February 12, 2025",
                "stars": "2.0",
                "title": "Not great unfortunately",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "I had high hopes for these diapers since they seem to be “clean” but unfortunately they did not work out for us. After a couple days of use, we had so many pee leaks. I changed a diaper and an hour later he plopped down on the floor and a puddle of pee formed under him. It did catch all poo, no leaks on the side or up the back and fit felt comparable to Dyper brand which is what we usually use."
            },
            "35": {
                "name": "Amazon Customer",
                "date": "Reviewed in the United States on January 9, 2025",
                "stars": "5.0",
                "title": "A chlorine free diaper that doesn’t break the bank!",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "Love this is a chlorine free diaper that is pretty affordable comparatively! Also run true to size versus others running small"
            },
            "36": {
                "name": "danimal",
                "date": "Reviewed in the United States on January 26, 2025",
                "stars": "2.0",
                "title": "Beware these will leak - not suitable for sleeping",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "I despise diapers for the sole reason I’m spending money on something that’s just going to get thrown away, but I can reconcile this with an attendant quality of life and convenience afforded me. What caught my eye about this brand was the unit price. On first impression they seemed an adequate replacement for the Mama Bear AMZ brand of been using. What if found was that nearly every time I deployed one of these diapers at nap or bedtime, the diaper would leak, creating more laundry that I didn’t need."
            },
            "37": {
                "name": "GMF",
                "date": "Reviewed in the United States on January 16, 2025",
                "stars": "5.0",
                "title": "Nice diapers",
                "product_specs": "Size: 1Unit Count: 224.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Bought as a gift, stated they liked them."
            },
            "38": {
                "name": "Brian&Alex",
                "date": "Reviewed in the United States on February 9, 2025",
                "stars": "2.0",
                "title": "Would not recommend",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "2 people found this helpful",
                "review": "These diapers ran a bit small , they would also leave small particles of white cotton like substance around the peri area. Almost as though they were falling apart somewhere inside the absorbent material. Felt cheaply made. Might be why they were 50% off when we purchased. But I would definitely not pay full price for these diapers. Not good for wearing over two hours as they fall apart."
            },
            "39": {
                "name": "Valerie Rogers",
                "date": "Reviewed in the United States on February 7, 2025",
                "stars": "2.0",
                "title": "Very Thin, No Back Scrunch",
                "product_specs": "Size: 5Unit Count: 144.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These diapers are literally thinner than WalMart parents choice brand diapers. The padding doesn’t go up very far at all. I had to change my baby hourly with these diapers. There is no back scrunch so up the back blowouts happen. I’m really glad I got these on half off sale or I would have felt even more ripped off. Seriously- save your $ and get parents choice or Up&Up."
            },
            "40": {
                "name": "Annie",
                "date": "Reviewed in the United States on December 1, 2024",
                "stars": "3.0",
                "title": "Thin, cheap",
                "product_specs": "Size: 3Unit Count: 88.0",
                "verified_purchase": true,
                "helpful_statement": "3 people found this helpful",
                "review": "These are basically luvs diapers if you’ve used those but with a cuter pattern."
            },
            "41": {
                "name": "Deb",
                "date": "Reviewed in the United States on January 9, 2025",
                "stars": "5.0",
                "title": "Worth the price!",
                "product_specs": "Size: 1Unit Count: 224.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Excellent for the price but small for the size of 11 lbs!!"
            },
            "42": {
                "name": "DH",
                "date": "Reviewed in the United States on October 9, 2024",
                "stars": "3.0",
                "title": "Not good absorption",
                "product_specs": "Size: 3Unit Count: 88.0",
                "verified_purchase": true,
                "helpful_statement": "2 people found this helpful",
                "review": "I was so excited to try this new diaper for a baby, I love finding diaper brands that are clean and better for the environment. These diapers did not absorb much at all, and I would not recommend them."
            },
            "43": {
                "name": "Sarah V.",
                "date": "Reviewed in the United States on July 18, 2024",
                "stars": "3.0",
                "title": "Not it.",
                "product_specs": "Size: 2Unit Count: 100.0",
                "verified_purchase": true,
                "helpful_statement": "5 people found this helpful",
                "review": "These were a great deal but I do not like these diapers. Super cute design but not functional. My 2 month old pees out of these constantly, and there is no little band in the back so his poop just shoot’s up the back and onto his clothes and whatever he is laying on/ in the carrier. I loved that they are “clean” but they just didn’t hold up in the absorbency department. They are super thin too! Comparable to the Walmart and Target brand in terms of thinness, but definitely not as absorbing."
            },
            "44": {
                "name": "Sadie",
                "date": "Reviewed in the United States on October 25, 2024",
                "stars": "3.0",
                "title": "They're alright",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These so an okay job. Not super sticky tabs. Feel thin in comparison to other diapers. Couple times some poo slightly leaked out."
            },
            "45": {
                "name": "That Zen Chic",
                "date": "Reviewed in the United States on December 3, 2024",
                "stars": "5.0",
                "title": "Best diapers I’ve tried so far",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "2 people found this helpful",
                "review": "I’ve been trying pretty much every clean diaper brand under the sun and I really love these for my boy. They seemed very light and thin at first I was worried about absorbency but they’re great! Very flexible. Stretchy, lightweight yet super absorbent. I’ll be sticking with these!"
            },
            "46": {
                "name": "AJ",
                "date": "Reviewed in the United States on October 15, 2024",
                "stars": "3.0",
                "title": "Diapers will leak",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "2 people found this helpful",
                "review": "This happened while feeding my baby. Came out of the leg hole, onto my pillow, down my side, and onto my white couch in seconds."
            },
            "47": {
                "name": "Rob",
                "date": "Reviewed in the United States on July 31, 2024",
                "stars": "4.0",
                "title": "Supper soft BUT Size up",
                "product_specs": "Size: 2Unit Count: 100.0",
                "verified_purchase": true,
                "helpful_statement": "7 people found this helpful",
                "review": "Supper soft and love it, but you should probably size up. 4 month old, 14.5 lbs wearing size 2 diaper has had several blowouts compared to other name brand diapers."
            },
            "48": {
                "name": "Soft and breathable",
                "date": "Reviewed in the United States on November 2, 2024",
                "stars": "3.0",
                "title": "Weird fit",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "They’re not very soft. Fit is off, and there’s no blowout protection."
            },
            "49": {
                "name": "Megan Gerston",
                "date": "Reviewed in the United States on January 13, 2025",
                "stars": "5.0",
                "title": "The quality!",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "This is a modal window.\n\nNo compatible source was found for this media.\nThe quality of these diapers are unmatched. So soft as if it’s real fabric. Extremely absorbent as well. On top of that it’s a very cute design."
            },
            "50": {
                "name": "Angelica Addeo",
                "date": "Reviewed in the United States on December 18, 2024",
                "stars": "5.0",
                "title": "Good customer service",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These didn’t work for us but the customer service did the right thing to help us out"
            },
            "51": {
                "name": "lilylu112",
                "date": "Reviewed in the United States on February 9, 2025",
                "stars": "2.0",
                "title": "Skip",
                "product_specs": "Size: 3Unit Count: 88.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These did not work great for us, they ripped, did not hold a ton, and with any weight would fall off. I think there are better options, also there was no indicator."
            },
            "52": {
                "name": "Gloria Camey",
                "date": "Reviewed in the United States on December 26, 2024",
                "stars": "5.0",
                "title": "Muy buenos",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "Muy buena calidad"
            },
            "53": {
                "name": "Grant",
                "date": "Reviewed in the United States on January 11, 2025",
                "stars": "2.0",
                "title": "Does the job",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Haven’t had any leaks yet. No skin irritation. Honestly it’s a good value for how cheap they are. No blow out protection and very thin. Make sure you change the but often. The fit is perfect I got a size 4 and the fit like a size 4."
            },
            "54": {
                "name": "Millie",
                "date": "Reviewed in the United States on November 17, 2024",
                "stars": "5.0",
                "title": "They work and I like they are good for sensitive skin",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Product (diapers) used for grandson. I like they are made for sensitive skin as babies have sensitive skin and don't want any irritants like perfumes, various fragrances, irritating the skin that the diaper covers."
            },
            "55": {
                "name": "Danielle",
                "date": "Reviewed in the United States on January 19, 2025",
                "stars": "2.0",
                "title": "Disappointed",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These fit really big, are very thin, not very absorbant and make my kid smell like pee. Bummed I bought such a big box😩"
            },
            "56": {
                "name": "Jessica Gilcrist",
                "date": "Reviewed in the United States on January 17, 2025",
                "stars": "2.0",
                "title": "Bad for blow outs",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Very soft diapers, but have had several blowouts. The best brand I have found is mama bear and I’ve tried four different brands now."
            },
            "57": {
                "name": "shrinkmomfl",
                "date": "Reviewed in the United States on February 23, 2025",
                "stars": "2.0",
                "title": "Not a good buy",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These diapers leak and run small"
            },
            "58": {
                "name": "Lynnann burnette",
                "date": "Reviewed in the United States on February 9, 2025",
                "stars": "2.0",
                "title": "Too thin",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "They were to thin\nHowever very soft"
            },
            "59": {
                "name": "CC Chancellor",
                "date": "Reviewed in the United States on February 1, 2025",
                "stars": "2.0",
                "title": "Absorption",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Diapers were not very absorbent and leaked not impressed lesson learned"
            },
            "60": {
                "name": "Jessica williams",
                "date": "Reviewed in the United States on September 19, 2024",
                "stars": "5.0",
                "title": "Very soft and velvety feeling holds waste really well",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "5 people found this helpful",
                "review": "Love this brand for my infant. Holds waste really well and still pretty dry after. Fits nicely i had a super preemie about 5 lbs when he started wearing these and he really liked them. Less fussy when wet."
            },
            "61": {
                "name": "Brooke Ruble",
                "date": "Reviewed in the United States on July 22, 2024",
                "stars": "5.0",
                "title": "True to size!",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "24 people found this helpful",
                "review": "Nice design, soft, and thin. They are true to size!! Slightly slimmer than pamper swaddlers, but slightly wider than Huggies. I like how the absorbency layer has breaks in it to account for natural curvatures of a babies body and thighs. Clean ingredients and no harsh chemicals. Great absorbency. Will buy again!"
            },
            "62": {
                "name": "ashley",
                "date": "Reviewed in the United States on October 11, 2024",
                "stars": "5.0",
                "title": "The only diaper my baby can wear",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "2 people found this helpful",
                "review": "PERFECT MATCH for sensitive skin. I have tried probably 15-20 brands and this is the ONLY ONE my daughter can wear rash free."
            },
            "63": {
                "name": "Mama",
                "date": "Reviewed in the United States on November 13, 2024",
                "stars": "5.0",
                "title": "Very stretchy- doesn’t sag",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Very nice diapers! I’m impressed."
            },
            "64": {
                "name": "Amazon Customer",
                "date": "Reviewed in the United States on August 11, 2024",
                "stars": "5.0",
                "title": "So soft!",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "5 people found this helpful",
                "review": "These diapers are not only cute but they’re super soft and they have good stretch! The quality is great love how they’re clean diapers! They stay on my baby and are blow out proof!! Definitely worth the price!"
            },
            "65": {
                "name": "khye scarlett",
                "date": "Reviewed in the United States on November 16, 2024",
                "stars": "5.0",
                "title": "great diapers",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "hardly any leaks!"
            },
            "66": {
                "name": "savannah",
                "date": "Reviewed in the United States on July 18, 2024",
                "stars": "5.0",
                "title": "5 stars for these",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "7 people found this helpful",
                "review": "The diapers are comfortable for baby, they fit nicely and from what I’ve seen no leaks at all. The quality is super nice and no rashes or eczema which my little one is prone to. 5 stars will continue to purchase"
            },
            "67": {
                "name": "The Wiggins",
                "date": "Reviewed in the United States on August 23, 2024",
                "stars": "2.0",
                "title": "Just okay",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "The lining of these are odd. They leaked for my daughter but they seamed comfortable for her to wear during the day but definitely not overnight Though they are cheap you may wanna do with something better. They dont fit like a Huggies size 6 does, they sem very small and are not as absorbent as i had hoped. Quality is just okay! I do love the look of the diapers but would find something better"
            },
            "68": {
                "name": "Jolyn Law",
                "date": "Reviewed in the United States on February 21, 2025",
                "stars": "1.0",
                "title": "Poor quality",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "I bought these diapers when they were on sale because they were really cute and I thought they would be good quality. They do not last long. I never have had much issues with blow outs but with these it was a blow out almost every single time and they also leaked the absorbant material. I could not wait to finish the pack so I could never buy them again"
            },
            "69": {
                "name": "Cayce Markham",
                "date": "Reviewed in the United States on October 12, 2024",
                "stars": "2.0",
                "title": "Not durable. Leak easily",
                "product_specs": "Size: 2Unit Count: 100.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Diaper literally falls apart when soiled. Might be ok for immobile babies but definitely not a good idea for crawlers. More mess than the price is worth. Just get the mama bear brand if you’re looking to cut cost."
            },
            "70": {
                "name": "Jacqueline",
                "date": "Reviewed in the United States on October 4, 2024",
                "stars": "2.0",
                "title": "Not good diapers at all",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These diapers are super thin, not soft, and countless times my daughter leaked out of them. Not happy with these, but we’ve used a package of them so I know we can’t return them since we used some."
            },
            "71": {
                "name": "Rachel",
                "date": "Reviewed in the United States on August 20, 2024",
                "stars": "2.0",
                "title": "Back to Pampers Swaddlers for me",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "I was initially excited about LILLYDOO diapers because they seemed plush and cute, but they ended up being a disappointment. The diapers aren’t long enough and kept getting too tight around my kid’s thighs. They don’t seem true to size and actually run small. I got them through an Amazon Prime special, but I won’t be buying them again. Not worth it for us."
            },
            "72": {
                "name": "M.N.",
                "date": "Reviewed in the United States on July 16, 2024",
                "stars": "5.0",
                "title": "Our most-loved diapers",
                "product_specs": "Size: 5Unit Count: 144.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "We used Lillydoo in Europe and were happy to see them come to the United States. This is our third kid in Lillydoo diapers. We have been happy with the premium quality."
            },
            "73": {
                "name": "Sherie R.",
                "date": "Reviewed in the United States on October 21, 2024",
                "stars": "2.0",
                "title": "Not absorbant",
                "product_specs": "Size: 3Unit Count: 88.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Sure these are soft, but they barely absorb and make my little one's diaper rash worse."
            },
            "74": {
                "name": "Lindsay H",
                "date": "Reviewed in the United States on September 30, 2024",
                "stars": "1.0",
                "title": "These just aren’t it.",
                "product_specs": "Size: 5Unit Count: 144.0",
                "verified_purchase": true,
                "helpful_statement": "11 people found this helpful",
                "review": "We switched from Mamabear and we are going back lillydoo diapers may be the monetarily cheaper option for clean diapers, but you’re going to pay for them with your time doing laundry. Even if I put my 18mo in a fresh diaper before her 2 hour nap, it never fails to leak.. forcing me to not only wash her off, but wash her bedding every. Single. Day.\n\nThey don’t fit comfortably on my toddler, they may be soft but because they are so soft they don’t stay on my toddler. I’ve resorted to putting on her training underwear on on top of her diaper so I can prevent it from slipping and moving and leaking. They gave her a rash and the little beads leak if the diapers too full.. which doesn’t take much considering the diapers leak after a 2 hour nap.\n\nWish I could get my money back."
            },
            "75": {
                "name": "RB",
                "date": "Reviewed in the United States on September 12, 2024",
                "stars": "5.0",
                "title": "Favorite diaper",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "I get these\nWhen I can afford it because they are tcf"
            },
            "76": {
                "name": "Tyler R 28",
                "date": "Reviewed in the United States on January 26, 2025",
                "stars": "1.0",
                "title": "Cheap for a reason",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "We have used pampers, LIDL, huggies and mostly target brands for my 19 month old sons diapers. Tried these cause they'd come same day. Overnight they leaked all over his pajamas, the aforementioned diapers have never leaked. These barely hold any fluids. Don't recommend. Buy target or even LIDL brand if you're in a bind."
            },
            "77": {
                "name": "Shane",
                "date": "Reviewed in the United States on October 29, 2024",
                "stars": "2.0",
                "title": "paper thin",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These are so thin and immediately leak. They feel like plastic"
            },
            "78": {
                "name": "amanda01217",
                "date": "Reviewed in the United States on January 18, 2025",
                "stars": "1.0",
                "title": "Small and terrible absorbency",
                "product_specs": "Size: 3Unit Count: 88.0",
                "verified_purchase": true,
                "helpful_statement": "3 people found this helpful",
                "review": "I pitched these diapers because they were discounted and seemed more sustainable. Upon receiving them i realized how small they were. I purchased the correct size but the diapers were short. They are also very thin. My child had so many leaks. Absorbency is not great. I definitely wouldn’t put a baby in them over night. I’ll stick with my Millie Moons."
            },
            "79": {
                "name": "Markie",
                "date": "Reviewed in the United States on August 25, 2024",
                "stars": "2.0",
                "title": "Run huge",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These were huge on my newborn compared to her coterie newborn. They don’t stay in place even if you secure them. With my newborns wiggles they almost slid down to her butt crack in the back. She’s peed through these too really thin"
            },
            "80": {
                "name": "stephanie cowan",
                "date": "Reviewed in the United States on October 7, 2024",
                "stars": "2.0",
                "title": "Not a fan of these",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "They fit my granddaughter great but in my opinion not great quality. They leak very easily"
            },
            "81": {
                "name": "Cody Dodrill",
                "date": "Reviewed in the United States on February 6, 2025",
                "stars": "1.0",
                "title": "Horrible",
                "product_specs": "Size: 2Unit Count: 100.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These are one of the worst diapers I’ve ever tried they don’t keep my baby dry and if you don’t change a poop right away it soaks out of the diaper gets all over the clothes!"
            },
            "82": {
                "name": "Shelby",
                "date": "Reviewed in the United States on January 14, 2025",
                "stars": "1.0",
                "title": "Quite Possibly Worst Buy",
                "product_specs": "Size: 5Unit Count: 144.0",
                "verified_purchase": true,
                "helpful_statement": "2 people found this helpful",
                "review": "The amount of times I had leaks, the gel coming out, rips, stretches around the legs. My god. They’re not very thick, and my partner always mentioned the smell of the diaper being bad. Was the worst diaper buy so far."
            },
            "83": {
                "name": "Adri",
                "date": "Reviewed in the United States on December 30, 2024",
                "stars": "1.0",
                "title": "They leak, a lot.",
                "product_specs": "Size: 3Unit Count: 88.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "I’ve been researching cleaner diaper options for my baby and came across these. When I first got them I thought they felt a little thin, but decided to try them anyway. Been using then for a week and they have leaked every single day. Will not be purchasing again. One star for being “clean”"
            },
            "84": {
                "name": "Amazon Customer",
                "date": "Reviewed in the United States on August 10, 2024",
                "stars": "2.0",
                "title": "Blowouts constantly",
                "product_specs": "Size: 2Unit Count: 100.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These may be super comfortable and soft, but they do not absorb well and cause blowouts often. Our daughter is on the lower end of the size range too for her current size. Won’t buy them again."
            },
            "85": {
                "name": "LETHAL LIPPS",
                "date": "Reviewed in the United States on December 24, 2024",
                "stars": "1.0",
                "title": "Pee comes right trough the diaper",
                "product_specs": "Size: 3Unit Count: 88.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Can not recommend in any way shape or form they’re not true the size they’re so thin, which is good but they cannot be worn overnight. They can’t even be worn to the park. They can’t be one for a walk. I’m going to use them with my swiffer that is all I wasted money."
            },
            "86": {
                "name": "teodora velikova",
                "date": "Reviewed in the United States on January 30, 2025",
                "stars": "1.0",
                "title": "Worse diapers",
                "product_specs": "Size: 3Unit Count: 88.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These are the worse diapers. So short and small. I had to throw away so many onesies, the poop was all over my son’s back. Discounted or not, not worth it."
            },
            "87": {
                "name": "alexis",
                "date": "Reviewed in the United States on December 29, 2024",
                "stars": "1.0",
                "title": "Thinnest diapers ever",
                "product_specs": "Size: 3Unit Count: 88.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "These things retain less moisture than a panty liner! I can’t believe how thin these actually are I feel like my baby could sweat through one of these and soak through to her pants in less than an hour"
            },
            "88": {
                "name": "Amy N.",
                "date": "Reviewed in the United States on January 26, 2025",
                "stars": "1.0",
                "title": "Flimsy and non-absorbing",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Like tissue paper. Leaks within an hour. Way worse than other brand I’ve used, including the generic Walmart brand. Feels cheap, acts cheap, and leaves the skin damp."
            },
            "89": {
                "name": "Mzalez89",
                "date": "Reviewed in the United States on February 14, 2025",
                "stars": "1.0",
                "title": "Waste of money",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Cheap and received in damaged box. Small for a size 4 be better off buying Walmart diapers for the price"
            },
            "90": {
                "name": "Amazon Customer",
                "date": "Reviewed in the United States on October 9, 2024",
                "stars": "1.0",
                "title": "Don’t waste your money!",
                "product_specs": "Size: 2Unit Count: 100.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "The absolute worst diapers we’ve used, and we’ve tried a bunch. I was excited to try these after searching for a good TCF option, and these were not it. My guy is 13 lbs and the size 2 seemed too small? They leaked no matter what, even if only on for an hour, and he broke out in a rash which has never been an issue for us with other brands. They also seemed too tight around his little legs and left red marks, but if I loosened the fasteners it would almost guarantee a blow out. I cannot understand where all the positive reviews come from."
            },
            "91": {
                "name": "MJ_NYC",
                "date": "Reviewed in the United States on July 8, 2024",
                "stars": "5.0",
                "title": "Cute and good quality",
                "product_specs": "Size: 3Unit Count: 88.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "My baby likes it 😊"
            },
            "92": {
                "name": "Marybeth",
                "date": "Reviewed in the United States on January 6, 2025",
                "stars": "1.0",
                "title": "Cheap quality, leaks",
                "product_specs": "Size: 1Unit Count: 112.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "Bought these because we saw they were on sale. Quality is very cheap, pee and poop leak through them. Never had issues with this before with any other diaper, very disappointing!"
            },
            "93": {
                "name": "K. Carpentier",
                "date": "Reviewed in the United States on November 1, 2024",
                "stars": "1.0",
                "title": "As bad as they come",
                "product_specs": "Size: 2Unit Count: 100.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "It’s our first baby so we have been on a journey to try out many different brands. These have been my least favorite so far. Do not care for the feel of the diaper at all, the fit did not seem to be quite as comfortable as other diapers in the same size range, and the clasps seemed very weak by comparison to other brands. Also caused some mild skin irritation on baby even with regular changing."
            },
            "94": {
                "name": "Cassandra Nankivell",
                "date": "Reviewed in the United States on February 11, 2025",
                "stars": "1.0",
                "title": "Doesnt stick well",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Can not get these diapers to stick and stay on. Terrible. No wondee they were on sale."
            },
            "95": {
                "name": "Worst purchase I’ve ever made!",
                "date": "Reviewed in the United States on February 3, 2025",
                "stars": "1.0",
                "title": "Your better off spending the extra few dollars",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "They leak, I’ve deal with nonstop diaper rash because they are so thin. Worst brand I’ve ever used"
            },
            "96": {
                "name": "adrienne lindsay",
                "date": "Reviewed in the United States on February 24, 2025",
                "stars": "1.0",
                "title": "material",
                "product_specs": "Size: 2Unit Count: 100.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "my 3 month old peed through every diaper. very disappointing"
            },
            "97": {
                "name": "Kira Trahan",
                "date": "Reviewed in the United States on January 12, 2025",
                "stars": "1.0",
                "title": "Terrible diapers",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Leak, do not fit properly, yes it's the correct size for my baby. Do not use these diapers!\nVery poor quality."
            },
            "98": {
                "name": "rebecca",
                "date": "Reviewed in the United States on January 24, 2025",
                "stars": "1.0",
                "title": "Very thin,spots that have very little padding",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "Had high hopes but very disappointed in the quality"
            },
            "99": {
                "name": "Mothergoose",
                "date": "Reviewed in the United States on February 1, 2025",
                "stars": "1.0",
                "title": "They leak",
                "product_specs": "",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "The leakage. Horrible."
            }
        }
    },
    "3": {
        "product_name": "ECO BOOM Training Pants for Toddler Potty, Hypoallergenic for Sensitive Skin, Size 5 Suitable for 27 to 38lb (XL - 22 Count)",
        "url": "https://www.amazon.com/Training-Toddler-Hypoallergenic-Sensitive-Suitable/dp/B0C3VLK67Y/ref=sr_1_3_sspa",
        "reviews": {
            "1": {
                "name": "Golfergirl",
                "date": "Reviewed in the United States on December 11, 2024",
                "stars": "5.0",
                "title": "I won't use any other diaper",
                "product_specs": "Size: Size 3Unit Count: 26.0",
                "verified_purchase": true,
                "helpful_statement": "2 people found this helpful",
                "review": "I love how these feel - super soft yet sturdy. Stand up to being a great overnight diaper, I've never had leaks or diaper rash. I've tried alllll the expensive, clean, non toxic bra mods. This one is a winner"
            },
            "2": {
                "name": "T. Potter",
                "date": "Reviewed in the United States on January 23, 2024",
                "stars": "5.0",
                "title": "Amazing",
                "product_specs": "Size: Size 4Unit Count: 24.0",
                "verified_purchase": true,
                "helpful_statement": "4 people found this helpful",
                "review": "These pull ups are just the best. We've been using the Eco Boom diapers for quite some time and made the switch to pull ups after we visited Japan and babies transition to pull up style much earlier, so we got used to them. Our son is 21 months and wearing size L.\n\nWe currently have inventory of Eco Pea pull ups in the same size, which we used with our first born, and the Eco Boom pull ups are much softer and have a better fit. The Eco Pea ones leave imprints on our son's waist and have leaked numerous times, while the Eco Boom pull ups have a higher rise and are softer all around. Not a single leak with them. My only complaint is the price fluctuation. I've set up a subscription, but it's annoying when one order is $16 and the next $21. I'm very particular about nontoxic diapers and these seem to be great quality. On a single budget though, we have to be watchful."
            },
            "3": {
                "name": "Maria Garcia",
                "date": "Reviewed in the United States on December 17, 2024",
                "stars": "5.0",
                "title": "Very very good pull-up hold very well all night",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Soft, strong , skin protection no leakage"
            },
            "4": {
                "name": "Paula",
                "date": "Reviewed in the United States on August 5, 2024",
                "stars": "4.0",
                "title": "Eco friendly diapers",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": true,
                "helpful_statement": "2 people found this helpful",
                "review": "These were very good diapers that came in the mail very quickly. We didn’t see any leakage from our toddler when using them I use a different brand normally, but didn’t order them in time and if ever in a pinch again, I would definitely order these."
            },
            "5": {
                "name": "Brooklyn Willerth",
                "date": "Reviewed in the United States on January 2, 2024",
                "stars": "5.0",
                "title": "We love these!",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": true,
                "helpful_statement": "4 people found this helpful",
                "review": "After our previous diaper brand switched from being chlorine free to elemental chlorine for bleaching, we decided to shop around for a better choice. A friend recommended these, which are totally chlorine free, and we’ve been super pleased with them.\nOur toddler is 21 months, just potty trained, and wears the pull ups at night and during naps. We have the XL size in the pull ups, which are objectively smaller than the ones we used before in the same 6 size, but fortunately they’ve been really absorbent. Our toddler is tall and almost 40lbs, and these will sometimes leave marks on her hips if she sleeps in a funny position, but they seem to fit well.\nEven if she pees multiple times overnight, we haven’t had any leaking. The diapers do get cold if they’re really full (as most do), but we haven’t had leaks or wet spots. No diaper rash either.\nWe are really health conscious and shopped around for a brand that used clean ingredients and didn’t have fragrances or bleach, and this is the one we liked best. Also love that it ships quickly and arrives quickly as sometimes a mama forgets to order, and this saves me the hassle of going to the store."
            },
            "6": {
                "name": "Nick",
                "date": "Reviewed in the United States on January 18, 2025",
                "stars": "5.0",
                "title": "So soft",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "The actual softest diapers I have used to date!"
            },
            "7": {
                "name": "Jordan Lewis",
                "date": "Reviewed in the United States on July 25, 2024",
                "stars": "5.0",
                "title": "Soft stretchy waistband!",
                "product_specs": "Size: Size 3Unit Count: 26.0",
                "verified_purchase": true,
                "helpful_statement": "5 people found this helpful",
                "review": "This is a modal window.\n\nNo compatible source was found for this media.\nThe size medium is the smallest pull up style diaper I have been able to find (except pampers that reeks of fragrance).\n\nWe also love the material of the ecoboom diapers. We have been using them for months & no diaper rash!\n\n10/10"
            },
            "8": {
                "name": "Konstantin",
                "date": "Reviewed in the United States on November 26, 2024",
                "stars": "5.0",
                "title": "Very soft and comfy",
                "product_specs": "Size: Size 4Unit Count: 24.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "Expensive, but great!"
            },
            "9": {
                "name": "carmen",
                "date": "Reviewed in the United States on October 30, 2024",
                "stars": "5.0",
                "title": "Best baby diapers",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "The best diapers for sensitive babies skin"
            },
            "10": {
                "name": "Jenika Farrell",
                "date": "Reviewed in the United States on October 5, 2024",
                "stars": "5.0",
                "title": "My favorite",
                "product_specs": "Size: Size 4Unit Count: 24.0",
                "verified_purchase": true,
                "helpful_statement": "2 people found this helpful",
                "review": "Love these for my toddler"
            },
            "11": {
                "name": "Kristen",
                "date": "Reviewed in the United States on May 19, 2024",
                "stars": "5.0",
                "title": "So soft, no leaks, non-toxic..",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": true,
                "helpful_statement": "2 people found this helpful",
                "review": "What is there not to love? They're so soft! My son is mostly potty trained while wearing these so his accidents were mostly small bits of urine while rushing to the bathroom so I can't speak for how they hold up for a child that isn't potty trained at all, but I bet they'll be perfect even then! I love these!"
            },
            "12": {
                "name": "Roseanne",
                "date": "Reviewed in the United States on June 17, 2024",
                "stars": "5.0",
                "title": "Great absorbancy",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": true,
                "helpful_statement": "3 people found this helpful",
                "review": "This is one of the few non-toxic brands that sell pull-ups for larger sizes that actually absorb the pee. These are great for nighttime; I've had no issues with leaking and the fit it comfortable yet snug where it needs to be."
            },
            "13": {
                "name": "Angela",
                "date": "Reviewed in the United States on December 21, 2023",
                "stars": "3.0",
                "title": "Not great for overnight",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": true,
                "helpful_statement": "6 people found this helpful",
                "review": "My son is full potty trained during the day but still needs to wear training pants at night. We had an issue with other eco-friendly training pants with leaking though the legs or the top during the night. These Eco Boom training pants fit wonderfully and do not leak the same way, however, the liquid gets absorbed all the way to the outside of the training pants if worn all night. There is not protective too layer keeping the urine inside. This isn’t a problem if he stays dry until the wee hours of the morning, but if he urinates within the first few hours of falling asleep, he will end up soaked and the training pants deteriorating. We will finish the package with the PUL cover on top and then continue our search for the best overnight non-toxic training pants!"
            },
            "14": {
                "name": "Dana from the Lone Star State",
                "date": "Reviewed in the United States on February 15, 2024",
                "stars": "5.0",
                "title": "Will reorder",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "I ordered these after the Pull-ups brand broke my toddler out in a rash. These are soft and so far haven’t leaked when there have been accidents. I used the sizing recommendation and it was accurate. They’re not as cutesy as some other brands, but after the first day, my little one didn’t seem to notice or care. And I love that there’s been no rash or irritation. I’ll be reordering!"
            },
            "15": {
                "name": "Tori Cerynik",
                "date": "Reviewed in the United States on August 30, 2023",
                "stars": "5.0",
                "title": "Best brand of diapers and pull ups",
                "product_specs": "Size: Size 3Unit Count: 26.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "These are by far my favorite brand of diapers and pull ups! The pull ups I don’t recommend unless your kid is potty training or potty trained already. They aren’t designed to hold the amount of pee like a diaper bc they are a pull up. We used the diapers prior to being potty trained and they hold sooo much pee over night. During and after potty training, we switched to the pull ups cause it’s easier for him to take on and off himself. The pull up still holds a lot of pee at night but not nearly as much as the diapers (bc they aren’t designed to)."
            },
            "16": {
                "name": "Joel H",
                "date": "Reviewed in the United States on March 21, 2024",
                "stars": "2.0",
                "title": "Sizing not the same as Huggies or other brands",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": true,
                "helpful_statement": "4 people found this helpful",
                "review": "So, I love the cleaner materials especially with my 3 year old having a lot of sensitivity to diapers, but the sizing doesn’t match with Huggies, Pampers, or Kirkland (at least for our kids). Even though my 3 year old I only weighs 26 lbs, she is tall and wears 4-5 T clothes. For overnight diapers she wears size 6 or in pull ups (4-5T). With this in mind, I got the equivalent size in Eco Boom. There’s are huge! They are a lot longer than the other diapers and they are very in the front area though not wide enough in the bottom area. It fits very weird. My toddler also complained these felt scratchy. I am reluctant to try a size down because of them feeling scratchy to her. I will continue my search for overnight pull ups. These diapers may be true to the recommended weight; however, I don’t think they would work for kiddos that are slim and tall."
            },
            "17": {
                "name": "Jared G",
                "date": "Reviewed in the United States on February 17, 2024",
                "stars": "5.0",
                "title": "The largest Pullup I can find.",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "The Dyper brand has been out of stock for months and we ran out of their 5T/6T my older son (60lb but skinny) sometimes needs at night. These are the first ones we've found that fit."
            },
            "18": {
                "name": "Syndra",
                "date": "Reviewed in the United States on July 13, 2023",
                "stars": "4.0",
                "title": "Good",
                "product_specs": "Size: Size 3Unit Count: 26.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "I like it. Good shape to fit my baby's butt and good material. Even if the baby urinates a lot, the surface remains dry after a whole night. No prints👍🏻，so clean but why there's no tape on the back？"
            },
            "19": {
                "name": "Don Murphy",
                "date": "Reviewed in the United States on February 25, 2024",
                "stars": "5.0",
                "title": "Very absorbent",
                "product_specs": "Size: Size 4Unit Count: 24.0",
                "verified_purchase": true,
                "helpful_statement": "One person found this helpful",
                "review": "As far as healthy, clean options…these reign supreme. They definitely hold up overnight, sized well, and very absorbent."
            },
            "20": {
                "name": "Amy",
                "date": "Reviewed in the United States on January 13, 2024",
                "stars": "5.0",
                "title": "Soft and really absorbent",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "We use these just at night and they work great"
            },
            "21": {
                "name": "Ruthie Petersen",
                "date": "Reviewed in the United States on January 14, 2024",
                "stars": "5.0",
                "title": "Everything",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "For twin toddlers. True to size,worked well"
            },
            "22": {
                "name": "Laraine Reynolds",
                "date": "Reviewed in the United States on November 30, 2023",
                "stars": "5.0",
                "title": "Fits Great",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Very soft training pants and they fit great."
            },
            "23": {
                "name": "Luis Guzman",
                "date": "Reviewed in the United States on January 10, 2025",
                "stars": "1.0",
                "title": "Garbage & from China 🤦🏾‍♂️",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": true,
                "helpful_statement": "",
                "review": "Worse leaking diapers! Never again."
            },
            "24": {
                "name": "TwoMama!",
                "date": "Reviewed in the United States on February 4, 2025",
                "stars": "4.0",
                "title": "Soft and super stretchy",
                "product_specs": "Size: Size 5Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I’ve tried Eco Boom bamboo diapers before, so I was excited to use these pull up style ones. The training pants are very soft to the touch, and fairly thick for training pants! The waistband and leg openings are very stretchy, but the waist is a little on the smaller side. Length wise, these do run bigger than I was expecting (especially for being size 5). My 21 month old is still under 30 pounds and wears regular size 6 diapers, but the bottom part of these training pants were slightly saggy and fit more like a size 7 diaper. The diaper themselves don’t leak through like a traditional training pant, so these are truly more comparable to Pampers 360 diapers! The wetness indicator is accurate, and these do hold a fairly decent amount of liquid. Although these are saggy at the bottom, I haven’t had any issues with leaks out the side for any type of liquid or solid. These are great for daytime diapers, but not for overnight. My toddler gets irritation rashes easily, but these are perfect for sensitive skin, and they’re fragrance free! Even with being stretched out all the way, I haven’t had any of these diapers accidentally ripping open during the day or while being pulled up- it does take a considerate amount of force to tear them off. The only downside is that there’s no sticky tab anywhere on the diaper to keep it rolled up when it needs discarded. I think these XL training pants are great diapers for active infants and toddlers!"
            },
            "25": {
                "name": "Steve",
                "date": "Reviewed in the United States on January 27, 2025",
                "stars": "4.0",
                "title": "pretty decent but got some quirks",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "for my lil dude, and they’re pretty solid overall. they’re super soft and don’t irritate his sensitive skin, which is a big win. they fit him nicely (he’s around 25 lbs), and they don’t leak much, even when he sleeps. but, here’s the deal: they don’t hold up as long as i’d hoped when he has a big accident. also, the sides are kinda hard to tear when you’re in a rush. they’re good for daytime use, though. just gotta change ‘em quick if things get messy. not perfect, but they get the job done."
            },
            "26": {
                "name": "CG",
                "date": "Reviewed in the United States on January 13, 2025",
                "stars": "4.0",
                "title": "Disposable bamboo training pants by ECO BOOM",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These disposable training pants from ECO BOOM have been working well for my daughter. She is 31 lbs, so she is on the higher end of the recommended weight range for the large size. They fit her well though, and they're very soft. My daughter is only potty trained during the day, so we only use them overnight. They contain her urine if/when she goes in her sleep. I'm not sure how they do during the day on a little one that is more active. They're a bit pricey ($43.99 at the time of this review plus a 5% off coupon), but that's to be expected for bamboo-anything."
            },
            "27": {
                "name": "JC",
                "date": "Reviewed in the United States on January 26, 2025",
                "stars": "4.0",
                "title": "Slightly more eco-conscious pull-ups",
                "product_specs": "Size: Size 5Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "This is probably still not the most eco-friendly way (I suspect that'd be washable, or just get to undies ASAP), but they're a pretty good middle ground. They work just as well as name-brand easy ups, with perhaps a slightly bulkier fit."
            },
            "28": {
                "name": "CustomerReview",
                "date": "Reviewed in the United States on January 29, 2025",
                "stars": "4.0",
                "title": "Large pack of training pants. Cleaner than Pull-ups and good fit.",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "So easy to use and great for night-time especially. Pull up well and have good fit on the sides and at waist. Soft, comfy and stretchy waist. Love the brand for clean and green products."
            },
            "29": {
                "name": "Eevee",
                "date": "Reviewed in the United States on February 22, 2025",
                "stars": "5.0",
                "title": "Fantastic Quality Training Pants",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are super soft and feel very nice on the skin! I'm not my son but he says they feel nice as well. They are a little bulky so depending on the size pants your child is wearing, they might give more of that diaper look than a normal diaper but if your child usually wears pants a little looser or a size up, then you won't notice it as much. It has great absorption and is perfect for when they're just learning and you want something they can pull up and down themselves for that sense of independence.\n\nThere is no scent to these which is great since I hate added chemicals to something going on my child's tush. These feel just so soft and must be very comfortable to wear and is a good in between diapers and underwear."
            },
            "30": {
                "name": "Sam",
                "date": "Reviewed in the United States on January 26, 2025",
                "stars": "5.0",
                "title": "Large pull-up style diapers - I'd advise to size down",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I didn't realize that these were like pull ups, but I like that about them. My baby is exiting size 4 and about to be ready for size 5, and I use Pampers normally. These diapers seem significantly larger than my current size 4 than I'm using. However since we're about ready to move to size 5, these diapers fit alright. It looks kind of big but that may just be the shape of it because feeling around and all, the diaper does seem to fit fine. I hope that helps figure out sizing for you.\n\nThe diapers seem to be soft and comfortable, no complaints or perceived uncomfortability. Handled a nice amount of urine, yet to have #2 yet but I'm sure it will be fine (can update review on a disappointing blowout should that happen).\n\nThese diapers are easy to pull up and easy to break to take off. The pull-up style diaper is better for comfort and easier to get on that your standard diaper, which is nice. If you're looking for an eco-friendly bamboo diaper, I am happy to recommend these!"
            },
            "31": {
                "name": "Jen",
                "date": "Reviewed in the United States on February 14, 2025",
                "stars": "5.0",
                "title": "Excellent quality!",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "We've used ECO BOOM diapers in the past, so I was excited to give their training pants a try! They fit our kiddo well. They are soft, and he said they felt comfortable to wear. Quite absorbent! We haven't had any leaks with these."
            },
            "32": {
                "name": "Critical Reviewer",
                "date": "Reviewed in the United States on February 8, 2025",
                "stars": "5.0",
                "title": "Great pull up style diapers",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are great pull-up style diapers. If you are using Elimination Communication, these can work for children at a younger age and be good protection while you learn their signals. So far, she hasn't had any blowouts, and she hasn't experienced any rashes."
            },
            "33": {
                "name": "Ryan",
                "date": "Reviewed in the United States on January 30, 2025",
                "stars": "5.0",
                "title": "ECO BOOM TRAINING PANTS FOR TODDLER POTTY",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These hypoallergenic training pants are designed for toddlers with sensitive skin, providing comfort and leakage protection for potty training.\n\nPros:\n_ Hypoallergenic and gentle on sensitive skin\n_ Stretchy waistband for a secure and comfortable fit\n_ Absorbent core prevents leaks during potty training\n_ Size 4 fits toddlers 20-31 lbs (48 count per pack)\n\nCons:\n\n_ Slightly pricier than conventional training pants\n\nFinal Verdict: A great choice for parents seeking a gentle, eco-friendly potty training solution with soft and absorbent materials."
            },
            "34": {
                "name": "Echo G",
                "date": "Reviewed in the United States on February 6, 2025",
                "stars": "5.0",
                "title": "Working well so far",
                "product_specs": "Size: Size 6Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "The first thing I noticed was that these were pretty soft. They seem to absorb pretty well and the fit is fairly accurate. The sides rip like they should when you tear them but don't tear apart unless you do it on purpose. The material seems to be decent quality and they haven't leaked so far. It is a little more pricey than store brands but quality is worth a little more cost."
            },
            "35": {
                "name": "June A.",
                "date": "Reviewed in the United States on February 7, 2025",
                "stars": "5.0",
                "title": "soft, easy to wear",
                "product_specs": "Size: Size 6Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "This was a good hypoallergenic diaper. I did not give my kiddo a rash. It holds a good amount of waste for training pants. My kid had no complaints to it."
            },
            "36": {
                "name": "HeddaGabler",
                "date": "Reviewed in the United States on January 12, 2025",
                "stars": "5.0",
                "title": "High quality pull ups",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers are high quality and super soft. Very easy to get on and off!\n\nWe are just considering potty training with out 13.5 month old with a goal of having him trained by 18 months. I know, I know - people will gasp with shock about this today, but somehow in the 1950s 92% of kids were trained by that age, so it is possible for almost all children. Let's see what happens!\n\nAnyway, these diapers are super soft and absorbent and seem really comfortable for my nany to wear. I will say that these are snug on my 26.5 pound child. I would say size up if you are close to the weight limit.\n\nOverall, really nice, trustworthy and quality diapers and I will be buying them again."
            },
            "37": {
                "name": "B",
                "date": "Reviewed in the United States on January 29, 2025",
                "stars": "5.0",
                "title": "soft!",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "SO soft! and great for my 2.5 year old. My son is now day potty trained and we have been using these for nights, it absorbs great, doesn't bother him and are SO soft! They are a bit pricey so I recommend trying it for kiddos with specific sensitives."
            },
            "38": {
                "name": "GreekGX",
                "date": "Reviewed in the United States on February 7, 2025",
                "stars": "5.0",
                "title": "Environmentally-conscious training diapers",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "These were excellent diapers that do not have any problems to them. They are sustainably made and I like that very much with this brand. When we used them, we saw no leaks from our kid. Although I usually use a different brand, I didn't purchase them in time, but I would absolutely get these again if I ever needed them."
            },
            "39": {
                "name": "Mari",
                "date": "Reviewed in the United States on February 1, 2025",
                "stars": "5.0",
                "title": "Perfect for potty training",
                "product_specs": "Size: Size 6Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "We are in the process of potty training and these pull-up diapers are very convenient. They fit my toddler perfectly and are nice and comfortable. They absorb very well and we havent had any issues with leaking so far. They pull up and down very easily and are nice and thick. Comes in 3 separate packs with a total of 48 in the entire box. Great quality diapers!"
            },
            "40": {
                "name": "Customer",
                "date": "Reviewed in the United States on January 24, 2025",
                "stars": "5.0",
                "title": "Incredible diapers",
                "product_specs": "Size: Size 5Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diapers remind me of a vastly improved version of Pampers pull ups. They are soft like Coterie but not as bulky. The absorbency blows Pampers out of the water, and they do not get lumpy the way Pampers do after a big pee. I'm using these overnight for my son and we've had zero problems. The elastic waist provides an excellent fit and it's very stretchy. SO impressed with these diapers. We will be ordering more!"
            },
            "41": {
                "name": "Nova",
                "date": "Reviewed in the United States on January 20, 2025",
                "stars": "5.0",
                "title": "Nice and Soft",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These training pants are great to wear on child who is potty training; they are perfect to wear during the day or overnight. They are soft and made from bamboo; they are gentle on the skin.\n\nEasy to put on and take off. And since you are not changing them as much, the price for 48 is reasonable.\n\nECO BOOM Training Pants for Toddler Potty, Hypoallergenic for Sensitive Skin, Size 4 Suitable for 20 to 31lb (L - 48 Count)"
            },
            "42": {
                "name": "winampplayer",
                "date": "Reviewed in the United States on January 25, 2025",
                "stars": "5.0",
                "title": "Soft and easy to slip on and off",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "The ECO BOOM Training Pants for Toddler Potty in size 4 is meant for 20-31 lbs. These training pants fit my toddler perfectly. They are very soft and easy to slip on and off. I prefer to use disposable training pants and then switching him over to underwear when he has less accidents to avoid more messes. Hopefully just one pack, which contain 48 training pants, will be enough before transitioning."
            },
            "43": {
                "name": "AH",
                "date": "Reviewed in the United States on February 2, 2025",
                "stars": "5.0",
                "title": "Soft and Absorbent",
                "product_specs": "Size: Size 6Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Very soft trainers with soft elastic side bands. I like that the absorbent bad goes all the way up the front and back. The front of the trainers are marked as such. There is also a wetness indicator line."
            },
            "44": {
                "name": "Amanda",
                "date": "Reviewed in the United States on January 10, 2025",
                "stars": "5.0",
                "title": "Works great",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These Training Pants for Toddlers are an excellent choice for potty training! Designed with hypoallergenic materials, they’re gentle on sensitive skin, preventing irritation and discomfort. The size 4 fits toddlers weighing 20 to 31 lbs perfectly, providing a secure and comfortable fit. They’re highly absorbent to handle little accidents while still allowing toddlers to feel wetness for effective potty training. The soft, flexible design ensures ease of movement, making them comfortable for active toddlers. With 48 in a pack, they offer great value. Highly recommended for stress-free and gentle potty training!"
            },
            "45": {
                "name": "Amazon_customer_k",
                "date": "Reviewed in the United States on February 1, 2025",
                "stars": "5.0",
                "title": "Ecoboom training pants",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are amazing. I love this brand!! I’ve tried their diapers and was so excited to grab these! They’re so soft and soooo absorbent. The sides are nice and wide. Very stretchy. And you are able to rip the sides without fuss, if needed. I’m over the heels with these."
            },
            "46": {
                "name": "H. K.",
                "date": "Reviewed in the United States on February 1, 2025",
                "stars": "5.0",
                "title": "Soft",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These training pants are great - soft and decently absorbent. Very useful for overnight while potty training in the daytime."
            },
            "47": {
                "name": "Ava",
                "date": "Reviewed in the United States on January 10, 2025",
                "stars": "5.0",
                "title": "Sturdy and well made",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These Training Pants for Toddlers are perfect for potty training! The hypoallergenic material is gentle on sensitive skin, ensuring comfort while preventing irritation. Size 4 fits toddlers weighing 20 to 31 lbs, offering a secure and snug fit for active little ones. These training pants are highly absorbent, providing protection during accidents while encouraging independence during the potty training process. With 48 in the pack, they offer great value for everyday use. Highly recommended for parents looking for a reliable, gentle, and effective training pant option!"
            },
            "48": {
                "name": "cat",
                "date": "Reviewed in the United States on January 14, 2025",
                "stars": "5.0",
                "title": "Should Do Fine",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Our youngest (and last) grandchild will soon be big enough for these. She's often over here with her parents, who live fairly close, so we keep various baby supplies handy, just in case. The size range covered, ease of use, and disposability prompted us to get these for a try. The granddaughter has a few pounds to go before these are a good fit, but her mother has checked them out and given her approval. Works for us!"
            },
            "49": {
                "name": "Penguin",
                "date": "Reviewed in the United States on January 26, 2025",
                "stars": "5.0",
                "title": "Good",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Good fit and snug in all the right places—also has some stretch to it so movement seems easy—they also aren’t bulky which is a plus and I love how I don’t have to worry too much about leakage."
            },
            "50": {
                "name": "ScottStyles",
                "date": "Reviewed in the United States on January 20, 2025",
                "stars": "5.0",
                "title": "Toddler pants",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These were not absorbent as much as my usual pampers pullups however they are good for light incidents and for sensitive skin we did not have any outbreaks or issues with these"
            },
            "51": {
                "name": "Lisa",
                "date": "Reviewed in the United States on January 31, 2025",
                "stars": "5.0",
                "title": "Bamboo",
                "product_specs": "Size: Size 6Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I love that these are made with bamboo. They are soft and absorbent. This is a great pack."
            },
            "52": {
                "name": "Big Daddy",
                "date": "Reviewed in the United States on January 26, 2025",
                "stars": "5.0",
                "title": "Nice!",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Nice diapers! Very soft and absorbent. Hypoallergenic materials kept our grandsons from getting any irritation. Fit well — nice & snug."
            },
            "53": {
                "name": "VK",
                "date": "Reviewed in the United States on January 18, 2025",
                "stars": "5.0",
                "title": "Soft and Absorbent Training Pants",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These training pants are very soft and high-quality. They fit my 26 lb child perfectly and are super absorbent, even for overnight use. The pack comes with 48 pants, which is great."
            },
            "54": {
                "name": "HeyThatsConnie",
                "date": "Reviewed in the United States on January 25, 2025",
                "stars": "5.0",
                "title": "Huge box of quality diapers.",
                "product_specs": "Size: Size 4Unit Count: 48.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Nice quality. Leakproof. Absorbent. Soft on the baby’s skin. Size is proper."
            },
            "55": {
                "name": "Amb",
                "date": "Reviewed in the United States on April 13, 2024",
                "stars": "5.0",
                "title": "Pretty good compared to the brand name we use",
                "product_specs": "",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "I'm comparing these to the brand-name potty-training diapers I have. Aside from no pretty pictures (not important for us, and my daughter doesn't care) on the diaper, they're overall just as good.\n\nSize/coverage: They're a little taller than the brand name. Not by much, but this has been helpful since my daughter is currently between sizes. The width is about the same. This brand is a little rounder, sSo it covers a little more of her bottom.\n\nThe stretchy straps on the sides are shorter on this brand, but they have more pull to them without being too loose. They're a little softer.\n\nThe absorbent area is similar in thickness and coverage, yet the brand name is just slightly softer. The difference is so small I don't think it matters. The brand name holds liquid a little better, but we haven’t had any accidents and this brand doesn’t slip off her bottom as easily when she’s active.\n\nIf you don't care about looks (again, not a deal breaker here) these are pretty good compared to the brand name, they're better if you need a bit more coverage without going up a size."
            },
            "56": {
                "name": "kttiekat",
                "date": "Reviewed in the United States on December 17, 2023",
                "stars": "4.0",
                "title": "Potty training is always a process",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I liked the price and hypoallergenic nature of these training pants. I can only say that I wish they would hold up a bit better during nap time or night time accidents. These seem to leak out the sides more then some other brands we used with our other 2 sons."
            },
            "57": {
                "name": "Verified Purchase",
                "date": "Reviewed in the United States on July 20, 2023",
                "stars": "4.0",
                "title": "Great absorbency, no leaks, and tear off fairly easily",
                "product_specs": "Size: Size 3Unit Count: 26.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "So far we've been using these pull ups after we ran out of our Huggies and Honest ones. They feel pretty soft from the outside. And in comparison, hold up really well. Our daughter is going through a potty training regression, so we've had our fair share of incredibly messy incidents. And not once has anything fallen out with these. They tear very easily from the sides, especially since I sometimes only have one hand to take them off and be prepared to clean up. They also hold a lot. Sometimes my daughter will go 2-3 times (#1) and when I take them off, they are so heavy but I'm shocked that nothing has leaked out! The only reason I don't rate them a 5 is that on more than one occasion, she has tried to pull them down and says \"it hurts\". So I don't know if they feel a little dry for her and rub up or something. We will usually take them off and apply a different brand and she's fine. Then we try again with these and have no issues. Not sure if coincidence or if she really doesn't like the feel of them at times."
            },
            "58": {
                "name": "L",
                "date": "Reviewed in the United States on January 25, 2024",
                "stars": "5.0",
                "title": "Perfect even for overnight!",
                "product_specs": "",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "We are right at the middle of potty training process so I was really excited to try this pull-ups. He doesn’t really wear anything thru the day because he is really good on going to potty but naps and night different story. He wore them overnight and as picture reflects he had to go few times. When I took it of he was dry and no prints on his skin, meaning material is gentle but absorbs moisture quickly. Super gentle on his skin and perfect for night time. He is almost 3 and sizing is perfect for us, very happy with these pull-up and it will last us at least few months. High quality, absorbs quickly and perfect for overnight!"
            },
            "59": {
                "name": "Nicole Tilford",
                "date": "Reviewed in the United States on August 2, 2023",
                "stars": "4.0",
                "title": "Will be great",
                "product_specs": "Size: Size 3Unit Count: 26.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Once my baby is old enough for potty training I think these will be great. I’ve used them a few times so far as they are her size and they hold well. I like the packaging, very eco friendly"
            },
            "60": {
                "name": "Heather A",
                "date": "Reviewed in the United States on July 14, 2023",
                "stars": "4.0",
                "title": "XL fits size 3T-4T pull up",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "I got these to try for my toddler. The material is so so soft and very absorbent. They hold just as much, if not more than our usual Pull-Up. The XL is comparable in size to a size 3T-4T pull-up. I knocked off a star only because they are a little bulkier than pull ups and seem like they wouldn’t be as comfortable with the added bulk."
            },
            "61": {
                "name": "Jana F",
                "date": "Reviewed in the United States on July 4, 2023",
                "stars": "4.0",
                "title": "Soft and comfy on baby's skin",
                "product_specs": "Size: Size 3Unit Count: 26.0",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "ECO BOOM Toddler Potty Training Pants\n\nFirst, I really like how soft these potty training pants are, especially around the waist and legs. Some pants chafe the skin but these do not. Might be because of the aloe in these which I love.\n\nThis size 3 is small for a potty-training child so also could easily be used as a diaper. There's nothing fancy about these pants, however they are very nice."
            },
            "62": {
                "name": "Super Reviewer",
                "date": "Reviewed in the United States on July 7, 2023",
                "stars": "4.0",
                "title": "ECO BOOM Toddler Potty Training Pants",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "I like that these are free from alcohol, chlorine, latex, perfumes, PVC, lotions, TBT, parabens, sulfates, and phthalates. I have been using them as an overnight pull up for my child that is newly potty trained. They run large so I would suggest sizing down. The training pants did not cause any irritation, I like that these are plain and have no additional prints, gender neutral and they have a wetness indicator."
            },
            "63": {
                "name": "Anna K.",
                "date": "Reviewed in the United States on October 9, 2023",
                "stars": "5.0",
                "title": "Soft and absorbent, run huge.",
                "product_specs": "Size: Size 4Unit Count: 24.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "My oldest turned 3 a week before I got these diapers. My twins were 21 months. I had a size 4,5,6 diapers all represented, and I was low on 4's so I ordered these in that size and they only fit my big girl. They ran huge and were soft and very absorbent, didn't tear or anything and were nice but very big. Thankfully we were still able to use them but be VERY wary of the sizing listed"
            },
            "64": {
                "name": "Sara Quiller",
                "date": "Reviewed in the United States on June 22, 2023",
                "stars": "4.0",
                "title": "These diapers are good!",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are very soft, good diapers. They don't smell like chemicals or anything. My only slight complaint is that they run a little bit so I would probably size down from your normal size."
            },
            "65": {
                "name": "K K OBrien",
                "date": "Reviewed in the United States on July 12, 2023",
                "stars": "5.0",
                "title": "Great for sliding onto wiggly legs!",
                "product_specs": "Size: Size 3Unit Count: 26.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I have a one year old who is becoming more wise to diaper changes and definitely learned that he can wiggle and twist to attempt and escape mid diaper duty. I wasn't sure whether this baby pant style diaper would be easier to get on him but I am so glad I tried them because they have made things so much better! You don't have to worry about strapping and positioning flaps just right like a typical diaper - just pull them up and you're good to go! I think I would say this brand runs a little bit larger if you are comparing size to size between brands, but I think the range they state is pretty accurate! The diapers seem to stay in place even with my constantly on the move little guy with no leaking or sliding down."
            },
            "66": {
                "name": "Kaila",
                "date": "Reviewed in the United States on July 7, 2023",
                "stars": "5.0",
                "title": "Soft with stretchy sides",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These baby pants are similar to pull ups. Very soft material with stretchy sides. They’re disposable so good to use if you’re trying to potty train.\nEach one has a yellow line indicator so you can see if your child has peed.\nSizing seems to be true to size, I’d say a tad on the bigger size but it will really depend how your kid’s built. Mine is taller for his age so even though he’s in the higher end of the weight limit for these, they fit a little larger on him around the waist. So it’ll totally vary depending on each child.\nOverall I feel like the quality is good, they’re really soft and seem comfortable on, and I like that they help with the transition from diaper to underwear."
            },
            "67": {
                "name": "Workin’ Mom",
                "date": "Reviewed in the United States on November 18, 2023",
                "stars": "5.0",
                "title": "Excellent quality",
                "product_specs": "Size: Size 3Unit Count: 26.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Soft, comfortable, highly absorbent."
            },
            "68": {
                "name": "Mom's Opinion",
                "date": "Reviewed in the United States on July 24, 2023",
                "stars": "5.0",
                "title": "Excellent",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I got these Training Pants for my Granddaughter for when she comes over to visit or I watch her. They are soft and have great absorbency and fit great. Don't leak and don't sag. She seems to be very comfortable in them, no complaints yet. I just tear them off when taking them off and tear off easy.\n\nI Recommend them, they are great."
            },
            "69": {
                "name": "mandy",
                "date": "Reviewed in the United States on July 14, 2023",
                "stars": "5.0",
                "title": "Very Good Quality",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "These are awesome! I currently had a popular brand's \"easy ups\" on hand to compare this product to. These are soo much softer in comparison - especially the elastic/stretchy part. They seem like they are much more comfortable. I like the neural white & plain look that these have as opposed to the character designs on other brands. Overall, I think the quality of these are great and they work very well for their intended purpose."
            },
            "70": {
                "name": "Mesully01",
                "date": "Reviewed in the United States on June 26, 2023",
                "stars": "5.0",
                "title": "True to size and work great",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "I got these pull ups for my 18 month old son to begin potty training and we really like them. We just started transitioning him from Costco size 5 diapers to size 6 so that’s what we ordered. As shown in my images these size 6 are the exact same size as the Kirkland brand size 6. These are on the left with Costco diapers to the right. They are absorbent and very soft and Comfortable. We are just beginning potty training and like that these go on and off easily without stretching out or breaking down."
            },
            "71": {
                "name": "Supermom55",
                "date": "Reviewed in the United States on July 7, 2023",
                "stars": "5.0",
                "title": "Very good, soft training diapers.",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "The diapers are soft and are not irritating the skin. They haven't leaked at all. They go up and down quite easily but they are a bit bigger than I expected. I got a size 6 because that's the size my son wears in his diapers and these aren't as snug. Since they are a tad bigger and haven't leaked I feel like they have very good absorbency. Will definitely be getting more of this brand."
            },
            "72": {
                "name": "654321",
                "date": "Reviewed in the United States on July 22, 2023",
                "stars": "5.0",
                "title": "Great",
                "product_specs": "Size: Size 4Unit Count: 24.0",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "Very absorbant and soft. Nice neutral packaging and holds a good amount for overnight. Easy to pull up and down."
            },
            "73": {
                "name": "AmazonCustomer",
                "date": "Reviewed in the United States on June 24, 2023",
                "stars": "5.0",
                "title": "Natural",
                "product_specs": "Size: Size 3Unit Count: 26.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Nice pull up training diapers. My daughter still has accidents during night time sleep and these are nicer than our usual ones. They are easy to get on and off. No scents/chemicals and most importantly, no leaks! My daughter is a size 4 diaper but size 3 fit her well so they do run slightly big. They feel soft and comfortable."
            },
            "74": {
                "name": "StarBright",
                "date": "Reviewed in the United States on June 21, 2023",
                "stars": "5.0",
                "title": "Easy to pull on",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I ordered an XL for my 30 lb 2 year old. He needs them for the night at times. When he has an accident they absorb well. The XL leaves some room for him to grow into, but still fits snug enough for use. If I used them nightly, I would have just ordered the L."
            },
            "75": {
                "name": "Dee",
                "date": "Reviewed in the United States on July 15, 2023",
                "stars": "5.0",
                "title": "Bamboo Pull Ups",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These potty training pants are easy to pull on and off and very absorbent. Great eco-friendly option for potty training process."
            },
            "76": {
                "name": "Doris",
                "date": "Reviewed in the United States on July 5, 2023",
                "stars": "5.0",
                "title": "Soft",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These diaper a so soft and hold much pee and never experienced a leak with this . I like this because it doesn’t have any cartons it doesn’t show through the clothes specially the light one."
            },
            "77": {
                "name": "TreeHouseTally",
                "date": "Reviewed in the United States on June 20, 2023",
                "stars": "5.0",
                "title": "Surprisingly good!",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I wasn't sure about these but they appear to work well. My daughter is slightly taller and with thick legs so these fit great. I think they may be slightly large with the sizing though. However, they are absorbent and ultra soft. A great alternative to the big brands."
            },
            "78": {
                "name": "Bettyhop",
                "date": "Reviewed in the United States on June 27, 2023",
                "stars": "5.0",
                "title": "Very absorbent and perfect anytime night or day",
                "product_specs": "Size: Size 4Unit Count: 24.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "My grand daughter is not quite ready for potty training, a little stubborn and these are so much nicer than regular pull ups. They don't leak, environmentally safer and very soft. The sizing is perfect and I'm very happy with these pull ups. Price is comparable with other pullups and well worth the purchase."
            },
            "79": {
                "name": "RandyM",
                "date": "Reviewed in the United States on July 5, 2023",
                "stars": "5.0",
                "title": "Good pack",
                "product_specs": "Size: Size 4Unit Count: 24.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "Very absorbent and soft"
            },
            "80": {
                "name": "Alice",
                "date": "Reviewed in the United States on June 22, 2023",
                "stars": "5.0",
                "title": "Great ECO material!",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "I love these Potty Training Pants....They fit the child well and don't leak...I love they are environmentally friendly"
            },
            "81": {
                "name": "Charity",
                "date": "Reviewed in the United States on July 26, 2023",
                "stars": "3.0",
                "title": "Surprisingly soft",
                "product_specs": "Size: Size 6Unit Count: 17.0",
                "verified_purchase": false,
                "helpful_statement": "One person found this helpful",
                "review": "These training pants are the softest I've ever encountered. My son is 40 lbs. and the size 6 fit very well with plenty of room to spare. I like that the design is simple and they aren't made with unnecessary material. The only drawback is they are visible under clothing without the pants being full. We are use to a slim fitting pull-up."
            },
            "82": {
                "name": "Real Review",
                "date": "Reviewed in the United States on August 14, 2023",
                "stars": "3.0",
                "title": "bulky",
                "product_specs": "Size: Size 4Unit Count: 24.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "These are thick and bulky, definitely feel like a diaper and not a pre-underwear training pants. The only way they are like training pants is that they pull up and down easily. But they are much more bulky than my regular size 4 diapers and absorb about the same. I won't buy them again."
            },
            "83": {
                "name": "Yesenia Ramirez",
                "date": "Reviewed in the United States on June 25, 2023",
                "stars": "2.0",
                "title": "No for my baby",
                "product_specs": "Size: Size 5Unit Count: 22.0",
                "verified_purchase": false,
                "helpful_statement": "",
                "review": "His little buns were out almost completely.\nThe fit is not right.\nI went according to the size chart but there’s just something off about this diapers.\nI did like that they don’t have a smell and they are soft.\nBut won’t be able to use them because of the fit."
            }
        }
    }
}